{
  "books":[
    {
        "id": 57597229,
        "url": "https://www.goodreads.com/book/show/57597229-a-day-like-this?from_choice=false&from_home_module=false",
        "title": "A Day Like This",
        "author": "Kelley McNeil",
        "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1626938014l/57597229.jpg",
        "description": "What if everything you’ve ever loved, ever known, ever believed to be true…just disappeared?nnAnnie Beyers has everything—a beautiful house, a loving husband, and an adorable daughter. It’s a day like any other when she takes Hannah to the pediatrician…until she wakes hours later from a car accident. When she asks for her daughter, confused doctors tell Annie that Hannah never existed. In fact, nothing after waking from the crash is the same as Annie remembers. Five happy years of her life apparently never happened.nnAnnie’s marriage is coming to an end. Now a successful artist living in Manhattan, she’s no longer home in their beloved upstate farmhouse. Her long-estranged sister is more like a best friend, and her recently deceased dog is alive and well. With each passing day, Annie’s remembered past and unfamiliar present begin to blur. Haunted by visions of Hannah, and with knowledge of things she can’t explain, Annie wonders…is everyone lying to her?nnThe search for answers leads Annie down an illuminating path far from home, to reconcile the memories with reality and to discover the truth about the life she’s living.",
        "rating": 4.31,
        "ratings": 6549,
        "publicationYear": 2021,
        "availability": "In Stock",
        "genre": "Mystery",
        "price": "$15"
      
    },
    {
      "id": 17927395,
      "url": "https://www.goodreads.com/book/show/17927395-a-court-of-mist-and-fury?from_choice=false&from_home_module=false",
      "title": "A Court of Mist and Fury (A Court of Thorns and Roses, #2)",
      "author": "Sarah J. Maas",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1546406996l/17927395._SY475_.jpg",
      "description": "Feyre survived Amarantha's clutches to return to the Spring Court—but at a steep cost. Though she now has the powers of the High Fae, her heart remains human, and it can't forget the terrible deeds she performed to save Tamlin's people.nnNor has Feyre forgotten her bargain with Rhysand, High Lord of the feared Night Court. As Feyre navigates its dark web of politics, passion, and dazzling power, a greater evil looms—and she might be key to stopping it. But only if she can harness her harrowing gifts, heal her fractured soul, and decide how she wishes to shape her future—and the future of a world cleaved in two.nnWith more than a million copies sold of her beloved Throne of Glass series, Sarah J. Maas's masterful storytelling brings this second book in her seductive and action-packed series to new heights.",
      "rating": 4.58,
      "ratings": 546741,
      "publicationYear": 2016,
      "availability": "In Stock",
      "genre": "Fantasy",
      "price": "$20"
    },
    {
      "id": 26032825,
      "url": "https://www.goodreads.com/book/show/26032825-the-cruel-prince?from_choice=false&from_home_module=false",
      "title": "The Cruel Prince (The Folk of the Air, #1)",
      "author": "Holly Black",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1574535986l/26032825._SY475_.jpg",
      "description": "This is a previously published cover edition of ISBN 9780316310277. An alternative cover edition for this ISBN can be found here.nnOf course I want to be like them. They’re beautiful as blades forged in some divine fire. They will live forever.nnAnd Cardan is even more beautiful than the rest. I hate him more than all the others. I hate him so much that sometimes when I look at him, I can hardly breathe.nnJude was seven when her parents were murdered and she and her two sisters were stolen away to live in the treacherous High Court of Faerie. Ten years later, Jude wants nothing more than to belong there, despite her mortality. But many of the fey despise humans. Especially Prince Cardan, the youngest and wickedest son of the High King.nnTo win a place at the Court, she must defy him–and face the consequences.nnAs Jude becomes more deeply embroiled in palace intrigues and deceptions, she discovers her own capacity for trickery and bloodshed. But as betrayal threatens to drown the Courts of Faerie in violence, Jude will need to risk her life in a dangerous alliance to save her sisters, and Faerie itself.",
      "rating": 4.09,
      "ratings": 441565,
      "publicationYear": 2018,
      "availability": "In Stock",
      "genre": "Fantasy",
      "price": "$18"
    },
    {
      "id": 35959740,
      "url": "https://www.goodreads.com/book/show/35959740-circe?from_choice=false&from_home_module=false",
      "title": "Circe",
      "author": "Madeline Miller",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1565909496l/35959740._SY475_.jpg",
      "description": "In the house of Helios, god of the sun and mightiest of the Titans, a daughter is born. But Circe is a strange child - not powerful, like her father, nor viciously alluring like her mother. Turning to the world of mortals for companionship, she discovers that she does possess power - the power of witchcraft, which can transform rivals into monsters and menace the gods themselves.nnThreatened, Zeus banishes her to a deserted island, where she hones her occult craft, tames wild beasts and crosses paths with many of the most famous figures in all of mythology, including the Minotaur, Daedalus and his doomed son Icarus, the murderous Medea, and, of course, wily Odysseus.nnBut there is danger, too, for a woman who stands alone, and Circe unwittingly draws the wrath of both men and gods, ultimately finding herself pitted against one of the most terrifying and vengeful of the Olympians. To protect what she loves most, Circe must summon all her strength and choose, once and for all, whether she belongs with the gods she is born from, or the mortals she has come to love.",
      "rating": 4.26,
      "ratings": 546869,
      "publicationYear": 2018,
      "availability": "In Stock",
      "genre": "Mythology",
      "price": "$22"
    },
    {
      "id": 58442561,
      "url": "https://www.goodreads.com/book/show/58442561-ecstatic?from_choice=false&from_home_module=false",
      "title": "Ecstatic (Arcane Mage #5)",
      "author": "T. S. Snow",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1628460189l/58442561._SY475_.jpg",
      "description": "Be a Magical Engineer, they saynIt’ll be fun, they say.nnYeah…not so much.nnFrom the minute I graduated, my life was turned upside down.nAnd things only got worse when I helped AMIA in their efforts to take down the resistance.nnNow Logan, Theo, and I are at the rebel's mercy.nThey want us dead, but we’re determined to see another day.nnAll we have to do is find a way out of this hole, fight a bazillion rebels,nAnd save the day, so I can go back to my men.nNo big deal, right?nnIf we live through this, and I get to see my men again, I'll be Ecstatic.nAnd if I take down my psycho cousin while we’re at it, that’s even better.",
      "rating": 4.49,
      "ratings": 544,
      "publicationYear": 2021,
      "availability": "In Stock",
      "genre": "Fantasy",
      "price": "$25"
    },
    {
      "id": 57903879,
      "url": "https://www.goodreads.com/book/show/57903879-redawn?from_choice=false&from_home_module=false",
      "title": "ReDawn (Skyward #2.2)",
      "author": "Brandon Sanderson",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1633436358l/57903879._SX318_.jpg",
      "description": "From #1 bestselling author Brandon Sanderson and Janci Patterson comes the second of three Skyward series novellas, each told from the perspective of a different member of the team back on Detritus. Read Alanik’s story between Starsight and Cytonic.nn“Don’t trust their lies. Don’t trust their false peace.” That is the warning that Alanik of the planet ReDawn gave the human pilot Spensa after Alanik’s ship crash-landed on Detritus. While accepting an invitation to meet with her people’s enemy, the Galactic Superiority, Alanik heard Spensa’s cry for help across the vastness of space, and she used her cytonic powers to hyperjump her ship to the source of that cry. What she found there was a shock—a whole planet of free humans fighting against the Superiority. Were they the allies her people desperately needed?n nWhen she recovered from her injuries and met the friendly humans Jorgen and FM of Skyward Flight, she found that her warning to Spensa had gone unheeded by the government of Detritus, and they were considering a peace overture from the Superiority. Now having returned to ReDawn, Alanik is dismayed to learn that her own people are falling into the exact same trap.n nThe faction in ReDawn’s government that wants to appease the Superiority has gained the upper hand. With Alanik’s mentor, Renakin captured, she has no one to turn to but Jorgen, FM, and their friend Rig. An ancient technology may have the power to save both of their planets from disaster, but can they discover its secrets before it’s too late?",
      "rating": 4.38,
      "ratings": 1159,
      "publicationYear": 2021,
      "availability": "In Stock",
      "genre": "Science Fiction",
      "price": "$24"
    }
    ,
    {
      "id": 59023699,
      "url": "https://www.goodreads.com/book/show/59023699-any-witch-way?from_choice=false&from_home_module=false",
      "title": "Any Witch Way: A Paranormal Women's Fiction Novel (A Witch in Wolf Wood, #3)",
      "author": "Lindsay Buroker",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1632020979l/59023699._SY475_.jpg",
      "description": "Thanks to her grandmother’s legacy, Morgen Keller has spent the summer learning about her witch heritage. She’s also spent the summer falling for the sexy werewolf next door.nnAs an unemployed divorcée, she never expected to find love again, but the gruff Amar has been her protector since she arrived in Bellrock. He’s fierce, loyal, strong, and he hardly ever rolls his eyes at her vegetarian ways. He’s a keeper.nnThere’s just one problem:nnWitches and werewolves are mortal enemies.nnWhen her mentor turns her back on her, and the coven delivers an ultimatum, Morgen must choose between her heritage and the man—the werewolf—she’s falling in love with.",
      "rating": 4.49,
      "ratings": 386,
      "publicationYear": 2021,
      "availability": "In Stock",
      "genre": "Paranormal",
      "price": "$19"
    }
    ,
    {
      "id": 27883214,
      "url": "https://www.goodreads.com/book/show/27883214-caraval?from_choice=false&from_home_module=false",
      "title": "Caraval (Caraval, #1)",
      "author": "Stephanie Garber",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1465563623l/27883214.jpg",
      "description": "A legendary competition.nA mesmerizing romance.nAn unbreakable bondnbetween two sisters.nnScarlett Dragna has never left the tiny island where she and her sister, Tella, live with their powerful, and cruel, father. Now Scarlett’s father has arranged a marriage for her, and Scarlett thinks her dreams of seeing Caraval—the faraway, once-a-year performance where the audience participates in the show—are over.nnBut this year, Scarlett’s long-dreamt-of invitation finally arrives. With the help of a mysterious sailor, Tella whisks Scarlett away to the show. Only, as soon as they arrive, Tella is kidnapped by Caraval’s mastermind organizer, Legend. It turns out that this season’s Caraval revolves around Tella, and whoever finds her first is the winner.nnScarlett has been told that everything that happens during Caraval is only an elaborate performance. Nevertheless she becomes enmeshed in a game of love, heartbreak, and magic. And whether Caraval is real or not, Scarlett must find Tella before the five nights of the game are over or a dangerous domino effect of consequences will be set off, and her beloved sister will disappear forever.nnWelcome, welcome to Caraval . . . beware of getting swept too far away.",
      "rating": 3.97,
      "ratings": 214402,
      "publicationYear": 2017,
      "availability": "In Stock",
      "genre": "Fantasy",
      "price": "$28"
    }
    ,
    {
      "id": 57903876,
      "url": "https://www.goodreads.com/book/show/57903876-sunreach?from_choice=false&from_home_module=false",
      "title": "Sunreach (Skyward #2.1)",
      "author": "Brandon Sanderson",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1632169745l/57903876._SX318_.jpg",
      "description": "From #1 bestselling author Brandon Sanderson and Janci Patterson comes the first of three Skyward series novellas, each told from the perspective of a different member of the team back on Detritus. Read FM's story between Starsight and Cytonic.nnWhen a planet-destroying Delver suddenly appears in the sky of Detritus and vanishes just as suddenly, FM knows that the last free human society got lucky. Her Skyward Flight companion, Spensa, figured out how to draw this Delver away, but it won’t be so easy next time.nnThe forces of the Galactic Superiority will be back—and if the Defiant Defense Force can’t figure out a way to escape the planet, humanity’s destruction is only a matter of time. Spensa’s mission to infiltrate the Superiority unveiled the secret to their hyperdrives—a cytonic slug species called the Taynix. Now FM’s flightleader, Jorgen, has found a large group of Taynix hiding in the caverns far below Detritus’s surface.nnFM and Jorgen must work together with the engineer Rig to awaken the mysterious alien Alanik and unlock the powers of the Taynix, or humanity will be trapped. With Spensa’s friend Minister Cuna of the Superiority stranded at the outpost of Sunreach, they need to figure out how to rescue her—or the Superiority government will be in the sole clutches of those who want to wipe out Detritus once and for all.",
      "rating": 4.29,
      "ratings": 3027,
      "publicationYear": 2021,
      "availability": "In Stock",
      "genre": "Science Fiction",
      "price": "$23"
    }
    ,
    {
      "id": 42196479,
      "url": "https://www.goodreads.com/book/show/42196479-sin-chocolate?from_choice=false&from_home_module=false",
      "title": "Sin & Chocolate (Demigods of San Francisco #1)",
      "author": "K.F. Breene",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1538852231l/42196479._SY475_.jpg",
      "description": "Some people are ordained for greatness…  Those people usually have a lot of drama in their life. Drama I happily do without. I live in a forgotten corner of nowhere for a reason: there is safety in anonymity. I have enough problems just trying to get by.  But when Kieran, a sinfully sexy demigod at the pinnacle of power, crashes into my life, suddenly my whole world is turned upside down.  He’s harboring a deadly secret, one that could destroy all he holds dear. He thinks I’m the key to his salvation, and he wants me to help him claim vengeance.  He also wants me with a passion that burns my body from the inside out.  To ignore him is impossible, but to give in to my desires, even for a night, would thrust me into danger I might not survive.  Can I resist the temptation?",
      "rating": 4.18,
      "ratings": 22636,
      "publicationYear": 2018,
      "availability": "In Stock",
      "genre": "Paranormal Romance",
      "price": "$20"
    }
    ,
    {
      "id": 57147519,
      "url": "https://www.goodreads.com/book/show/57147519-broken-bonds?from_choice=false&from_home_module=false",
      "title": "Broken Bonds (Lizzie Grace #8)",
      "author": "Keri Arthur",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1613921511l/57147519._SY475_.jpg",
      "description": "The winds of change are finally whispering through the Faelan Werewolf Reservation...nnnLizzie Grace is doing her utmost to ignore the portents of doom, wanting nothing more than enjoy her life and her time with Aiden O'Connor while she still can. But the song of the once unprotected and very powerful wellspring still washes across the distant shores of darkness, and it continues to draw evil to the reservation.nnnThe one that arrives this time is different from the others. Not only is it skilled in magic, but its kills are very specific. Very targeted. As the brutal deaths mount up and she, Monty, and Aiden struggle to find answers and stop the killings, Lizzie begins to suspect there's more to this particular evil than meets the eye.nnnEspecially when it helps save the life of a child.nnnBut the biggest threat to Lizzie comes not in the form of evil, but rather the changes whispered on the wind.nnBecause the werewolf Aiden once asked to be his wife has finally arrived back in the reservation.nnnAnd she's determined to get her man.",
      "rating": 4.54,
      "ratings": 605,
      "publicationYear": 2021,
      "availability": "In Stock",
      "genre": "Urban Fantasy",
      "price": "$26"
    }    
    ,
    {
      "id": 36337550,
      "url": "https://www.goodreads.com/book/show/36337550-the-7-deaths-of-evelyn-hardcastle?from_choice=false&from_home_module=false",
      "title": "The 7½ Deaths of Evelyn Hardcastle",
      "author": "Stuart Turton",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1506896221l/36337550.jpg",
      "description": "Aiden Bishop knows the rules. Evelyn Hardcastle will die every day until he can identify her killer and break the cycle. But every time the day begins again, Aiden wakes up in the body of a different guest at Blackheath Manor. And some of his hosts are more helpful than others. With a locked room mystery that Agatha Christie would envy, Stuart Turton unfurls a breakneck novel of intrigue and suspense.nnFor fans of Claire North, and Kate Atkinson, The 7½ Deaths of Evelyn Hardcastle is a breathlessly addictive mystery that follows one man's race against time to find a killer, with an astonishing time-turning twist that means nothing and no one are quite what they seem.nnThis inventive debut twists together a thriller of such unexpected creativity it will leave readers guessing until the very last page.",
      "rating": 3.88,
      "ratings": 202378,
      "publicationYear": 2018,
      "availability": "In Stock",
      "genre": "Mystery",
      "price": "$22"
    }
    ,
    {
      "id": 58745274,
      "url": "https://www.goodreads.com/book/show/58745274-martyr-s-promise?from_choice=false&from_home_module=false",
      "title": "Martyr's Promise (Elemental Covenant, #2)",
      "author": "Elizabeth Hunter",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1628636614l/58745274._SY475_.jpg",
      "description": "When Summer Mackenzie and her boyfriend disappear in the fog-shrouded forests of Northern California, it sets off more than one alarm. The sheriff’s department is looking for them, the state rangers are on their trail, and even private security companies have gotten involved.nnBut Summer wasn’t an ordinary college student; she was a human born into the immortal Mackenzie clan, a line of powerful vampires from the Great Smoky Mountains. Now Carwyn ap Bryn and Brigid Connor are getting messages from allies across the world, old rivals, and new friends, all wanting to know where Summer is and why hikers along the Lost Coast keep going missing.nnIf Brigid and Carwyn can’t find Summer, tensions between vampire clans might just snap, leaving more than just the immortal world bloody.nnThey may know how to search the wilderness, but the Northern California woods hold more than the average share of mysteries. Secretive immortals, suspicious humans, and ancient myths are all at home in a land where human highways come to a dead end, and dense forests meet rugged coast.",
      "rating": 4.74,
      "ratings": 448,
      "publicationYear": 2021,
      "availability": "In Stock",
      "genre": "Paranormal Fantasy",
      "price": "$28"
    }
    ,
    {
      "id": 59428934,
      "url": "https://www.goodreads.com/book/show/59428934-knot-of-shadows?from_choice=false&from_home_module=false",
      "title": "Knot of Shadows (Penric and Desdemona #11)",
      "author": "Lois McMaster Bujold",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1634872321l/59428934._SY475_.jpg",
      "description": "When a corpse is found floating face-down in Vilnoc harbor that is not quite as dead as it seems, Temple sorcerer Penric and his chaos demon Desdemona are drawn into the uncanny investigation. Pen’s keen questions will take him across the city of Vilnoc, and into far more profound mysteries, as his search for truths interlaces with tragedy.",
      "rating": 4.48,
      "ratings": 446,
      "publicationYear": 2021,
      "availability": "In Stock",
      "genre": "Fantasy",
      "price": "$24"
    }
    ,    
    {
      "id": 44780064,
      "url": "https://www.goodreads.com/book/show/44780064-amethyst-witch?from_choice=false&from_home_module=false",
      "title": "Amethyst Witch (Stacy Justice, #0.5)",
      "author": "Barbra Annino",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1554330096l/44780064._SX318_.jpg",
      "description": "Stacy Justice is a young reporter who lives in Chicago, far away from the kooky small town of Amethyst, Illinois, where she was raised by a family of witches. She’s perfectly content with her career, her cat, and her lack of a love life until her cousin informs her that their grandfather is deathly ill. Stacy road-trips home only to discover that her grandfather was poisoned, her grandmother has confessed to the crime, and there’s a new chief in town who is easy on the eyes, but tough on witches. nnNow, the reluctant witch must prove her grandmother’s innocence, save her grandfather from meeting an untimely end, and fight the killer that’s bent on destroying them all. nnThis is the prequel novel to the Stacy Justice Witch Mysteries — where secrets only lead to more secrets and being the member of a family means that you make sacrifices that can lead to murder.nnPreviously published as Witch Way To Amethyst.",
      "rating": 4.32,
      "ratings": 1609,
      "publicationYear": 2016,
      "availability": "In Stock",
      "genre": "Mystery",
      "price": "$20"
    }
    ,
    {
      "id": 29056083,
      "url": "https://www.goodreads.com/book/show/29056083-harry-potter-and-the-cursed-child?from_choice=false&from_home_module=false",
      "title": "Harry Potter and the Cursed Child: Parts One and Two (Harry Potter, #8)",
      "author": "John Tiffany",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1470082995l/29056083._SY475_.jpg",
      "description": "Based on an original new story by J.K. Rowling, Jack Thorne and John Tiffany, a new play by Jack Thorne, Harry Potter and the Cursed Child is the eighth story in the Harry Potter series and the first official Harry Potter story to be presented on stage. The play will receive its world premiere in London’s West End on July 30, 2016.nnIt was always difficult being Harry Potter and it isn’t much easier now that he is an overworked employee of the Ministry of Magic, a husband and father of three school-age children.nnWhile Harry grapples with a past that refuses to stay where it belongs, his youngest son Albus must struggle with the weight of a family legacy he never wanted. As past and present fuse ominously, both father and son learn the uncomfortable truth: sometimes, darkness comes from unexpected places.",
      "rating": 3.56,
      "ratings": 813002,
      "publicationYear": 2016,
      "availability": "In Stock",
      "genre": "Fantasy",
      "price": "$20"
    },
    {
      "id": 57730258,
      "url": "https://www.goodreads.com/book/show/57730258-the-christmas-pig?from_choice=false&from_home_module=false",
      "title": "The Christmas Pig",
      "author": "J.K. Rowling",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1635373481l/57730258.jpg",
      "description": "A heartwarming, page-turning adventure about one child's love for his most treasured thing, and how far he will go to find it. A tale for the whole family to fall in love with, from one of the world’s greatest storytellers.nnOne boy and his toy are about to change everything...nnJack loves his childhood toy, Dur Pig. DP has always been there for him, through good and bad. Until one Christmas Eve something terrible happens — DP is lost. But Christmas Eve is a night for miracles and lost causes, a night when all things can come to life... even toys. And Jack’s newest toy — the Christmas Pig (DP’s replacement) — has a daring plan: Together they’ll embark on a magical journey to seek something lost, and to save the best friend Jack has ever known...",
      "rating": 4.19,
      "ratings": 1285,
      "publicationYear": 2021,
      "availability": "In Stock",
      "genre": "Fantasy",
      "price": "$25"
    }    
    ,
    {
      "id": 51901147,
      "url": "https://www.goodreads.com/book/show/51901147-the-ballad-of-songbirds-and-snakes?from_choice=false&from_home_module=false",
      "title": "The Ballad of Songbirds and Snakes (The Hunger Games, #0)",
      "author": "Suzanne Collins",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1593892032l/51901147._SY475_.jpg",
      "description": "It is the morning of the reaping that will kick off the tenth annual Hunger Games. In the Capital, eighteen-year-old Coriolanus Snow is preparing for his one shot at glory as a mentor in the Games. The once-mighty house of Snow has fallen on hard times, its fate hanging on the slender chance that Coriolanus will be able to outcharm, outwit, and outmaneuver his fellow students to mentor the winning tribute.nnThe odds are against him. He's been given the humiliating assignment of mentoring the female tribute from District 12, the lowest of the low. Their fates are now completely intertwined -- every choice Coriolanus makes could lead to favor or failure, triumph or ruin. Inside the arena, it will be a fight to the death. Outside the arena, Coriolanus starts to feel for his doomed tribute... and must weigh his need to follow the rules against his desire to survive no matter what it takes.",
      "rating": 3.82,
      "ratings": 258589,
      "publicationYear": 2020,
      "availability": "In Stock",
      "genre": "Dystopian",
      "price": "$30"
    }
    ,
    {
      "id": 58831274,
      "url": "https://www.goodreads.com/book/show/58831274-forbidden-honor?from_choice=false&from_home_module=false",
      "title": "Forbidden Honor (Dragon Royals, #1)",
      "author": "May Dawson",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1629667536l/58831274._SY475_.jpg",
      "description": "In my world, dragon shifters rule. Dragon shifters are always royals. They’re always male. They’re always assholes.nnAn orphaned servant like me? Everyone assumes on first shift, I’ll turn into a squirrel.nnInstead, I grow wings. Breathe fire. Throw the world into chaos.nnNo one wants a girl in the Royal Dragon Guard. So I’m disguised as a man and sent off to military training.nnThe Dragon Royals are not a welcoming bunch. These princely scions of the four ruling families have been training to fight the plague-crazed Scourge since they were toddlers. Every girl in the city dreams of winning the heart of one of the dragon nobles, but they only care about each other.nnJaik, the cold-hearted hero who never smiles and never falters. Arren, who kills without mercy and guards his friends fiercely. Lynx and Branick, the twin spymasters with deadly swords. Talisyn, with the beautiful cruel mouth and endless bravery. nnBy night, I’m the servant they flirt with. I’m the one stealing Jaik’s heart and kissing Talisyn and antagonizing Arren. All the while, Branick and Lynx fret that I’m a spy, sent to destroy the Royals.nnBy day, I’m Lucien Finn, the man they despise and the dragon shifter they have to fight alongside.nnThese royals are determined to make me fall, and the princes play dirty. Can I ignore the pull they have on my heart and kick them off their thrones?nnOr will they break the maid... or kill the man? What will it do to us all when they finally discover the truth about who I truly am?nnIf cocky dragon shifters, steamy scenes, and snarky heroines who refuse to choose anything less than ALL their heart's desires offend...then back away. Otherwise, scroll up and dive into the adventure alongside Honor.",
      "rating": 4.4,
      "ratings": 558,
      "publicationYear": 2021,
      "availability": "In Stock",
      "genre": "Fantasy Romance",
      "price": "$27"
    }
    ,
    {
      "id": 33590260,
      "url": "https://www.goodreads.com/book/show/33590260-kingdom-of-ash?from_choice=false&from_home_module=false",
      "title": "Kingdom of Ash (Throne of Glass, #7)",
      "author": "Sarah J. Maas",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1531922609l/33590260.jpg",
      "description": "Aelin Galathynius has vowed to save her people ― but at a tremendous cost. Locked within an iron coffin by the Queen of the Fae, Aelin must draw upon her fiery will as she endures months of torture. The knowledge that yielding to Maeve will doom those she loves keeps her from breaking, but her resolve is unraveling with each passing day…nnWith Aelin captured, friends and allies are scattered to different fates. Some bonds will grow even deeper, while others will be severed forever. As destinies weave together at last, all must fight if Erilea is to have any hope of salvation.nnYears in the making, Sarah J. Maas's New York Times bestselling Throne of Glass series draws to an explosive conclusion as Aelin fights to save herself―and the promise of a better world.",
      "rating": 4.56,
      "ratings": 200111,
      "publicationYear": 2018,
      "availability": "In Stock",
      "genre": "Fantasy",
      "price": "$35"
    }    
    ,
    {
      "id": 42947844,
      "url": "https://www.goodreads.com/book/show/42947844-sin-magic?from_choice=false&from_home_module=false",
      "title": "Sin & Magic (Demigod of San Francisco #2)",
      "author": "K.F. Breene",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1543122419l/42947844._SY475_.jpg",
      "description": "I've agreed to work for a Demigod. My job? Find the spirit of his mother and release her before his vengeful father finds out and kills us all.nnHave I lost my mind?n nThankfully, I don't have to do it alone. Kieran has brought in help: a Necromancer who loves to flirt with danger. Bria can help me find the clues to free Kieran's mom.n nShe can also help me learn my potent and extremely terrifying magic.n nBut as we work deeper into magical San Francisco, we uncover a minefield waiting to explode. I'm learning that there are far worse things than death.",
      "rating": 4.37,
      "ratings": 12321,
      "publicationYear": 2018,
      "availability": "In Stock",
      "genre": "Urban Fantasy",
      "price": "$28"
    }
    ,
    {
      "id": 53287484,
      "url": "https://www.goodreads.com/book/show/53287484-midnight-sun?from_choice=false&from_home_module=false",
      "title": "Midnight Sun (The Twilight Saga, #5)",
      "author": "Stephenie Meyer",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1588597375l/53287484.jpg",
      "description": "When Edward Cullen and Bella Swan met in Twilight, an iconic love story was born. But until now, fans have heard only Bella's side of the story. At last, readers can experience Edward's version in the long-awaited companion novel, Midnight Sun.nnThis unforgettable tale as told through Edward's eyes takes on a new and decidedly dark twist. Meeting Bella is both the most unnerving and intriguing event he has experienced in all his years as a vampire. As we learn more fascinating details about Edward's past and the complexity of his inner thoughts, we understand why this is the defining struggle of his life. How can he justify following his heart if it means leading Bella into danger?",
      "rating": 3.73,
      "ratings": 154083,
      "publicationYear": 2020,
      "availability": "In Stock",
      "genre": "Paranormal Romance",
      "price": "$32"
    }
    ,
    {
      "id": 56637938,
      "url": "https://www.goodreads.com/book/show/56637938-cackle?from_choice=false&from_home_module=false",
      "title": "Cackle",
      "author": "Rachel Harrison",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1616026271l/56637938.jpg",
      "description": "All her life, Annie has played it nice and safe. After being unceremoniously dumped by her longtime boyfriend, Annie seeks a fresh start. She accepts a teaching position that moves her from Manhattan to a small village upstate. She’s stunned by how perfect and picturesque the town is. The people are all friendly and warm. Her new apartment is dreamy too, minus the oddly persistent spider infestation. n nThen Annie meets Sophie. Beautiful, charming, magnetic Sophie, who takes a special interest in Annie, who wants to be her friend. More importantly, she wants Annie to stop apologizing and start living for herself. That’s how Sophie lives. Annie can’t help but gravitate toward the self-possessed Sophie, wanting to spend more and more time with her, despite the fact that the rest of the townsfolk seem…a little afraid of her. And like, okay. There are some things. Sophie’s appearance is uncanny and ageless, her mansion in the middle of the woods feels a little unearthly, and she does seem to wield a certain power…but she couldn’t be…could she?",
      "rating": 3.77,
      "ratings": 2109,
      "publicationYear": 2021,
      "availability": "In Stock",
      "genre": "Horror",
      "price": "$30"
    }
    ,
    {
      "id": 36307634,
      "url": "https://www.goodreads.com/book/show/36307634-king-of-scars?from_choice=false&from_home_module=false",
      "title": "King of Scars (King of Scars, #1)",
      "author": "Leigh Bardugo",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1525110825l/36307634._SY475_.jpg",
      "description": "Face your demons... or feed them.nnThe dashing young king, Nikolai Lantsov, has always had a gift for the impossible. No one knows what he endured in his country's bloody civil war--and he intends to keep it that way. Now, as enemies gather at his weakened borders, Nikolai must find a way to refill Ravka's coffers, forge new alliances, and stop a rising threat to the once-great Grisha Army.nnYet with every day a dark magic within him grows stronger, threatening to destroy all he has built. With the help of a young monk and a legendary Grisha general, Nikolai will journey to the places in Ravka where the deepest magic survives to vanquish the terrible legacy inside him. He will risk everything to save his country and himself. But some secrets aren't meant to stay buried--and some wounds aren't meant to heal.",
      "rating": 4.19,
      "ratings": 103843,
      "publicationYear": 2019,
      "availability": "In Stock",
      "genre": "Fantasy",
      "price": "$25"
    }
    ,
    {
      "id": 58933375,
      "url": "https://www.goodreads.com/book/show/58933375-mind-over-magic?from_choice=false&from_home_module=false",
      "title": "Mind over Magic (A Witch in Wolf Wood, #1)",
      "author": "Lindsay Buroker",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1630903044l/58933375._SY475_.jpg",
      "description": "As a bookish, introverted database programmer, Morgen Keller never thought she was a candidate for a midlife crisis. That was before her husband divorced her, her boss let her go, and her grandmother died. Forty wasn’t supposed to look like this.nnWhen Morgen heads up to the small town of Bellrock, Washington, to settle the estate, she looks forward to taking a peaceful break from life and figuring out what she’s going to do next.nnBut peace isn’t to be had. The old farmhouse is full of witch paraphernalia, a fearsome werewolf has claimed the property, and contrary to what the family was told, Grandma didn’t die of natural causes.nnEmbroiled in a mystery, and heir to powers she knew nothing about, Morgen must turn to the only person who might be able to help: the werewolf who threatened to rip her throat out for trespassing.nnThis isn’t the fresh start on life that Morgen had in mind.",
      "rating": 4.04,
      "ratings": 1480,
      "publicationYear": 2021,
      "availability": "In Stock",
      "genre": "Urban Fantasy",
      "price": "$27"
    }
    ,
    {
      "id": 58703795,
      "url": "https://www.goodreads.com/book/show/58703795-follow-the-crumbs?from_choice=false&from_home_module=false",
      "title": "Follow the Crumbs (Two Broomsticks Gas & Grill Witch #4)",
      "author": "Amanda M. Lee",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1628126626l/58703795._SY475_.jpg",
      "description": "There’s a prominent threat on the block … and he might just be sharing Stormy Morgan’s roof.nnShe’s a new witch but she has a big problem … and it talks. Her new roommate Krankle may look cute but he’s a huge pain in her posterior. He’s also hiding something. Before she can focus on that, however, the unthinkable happens.nOn the highway leading out of town, three vehicles are involved in an accident. One belongs to Harold Lautner, the former head of the senior center who went missing months before. He was presumed dead in a hunting accident, but now the truck he was driving at the time he fell off the face of the earth is front and center … and emergency crews say there’s nobody to save inside.nnHunter Ryan, Stormy’s boyfriend and a police officer in Shadow Hills, is chasing lead after lead but they’re going nowhere … and then things get worse.nA magical shadow, the type Stormy isn’t ready to fight, is taking over the town. The Winchester witches, who are eager to help, can’t offer much in the way of aid because their magic is being affected by the shadow. That leaves Stormy to solve things, and she has no idea how to do it.nnStormy is eager to learn but the curve is steep. Alone, she knows she will fail. That means her new friends have to pitch in and help … including Krankle.nSomeone is lying. Someone is playing games. The answer to the question might be closer than it seems.nnStormy has a fight on her hands. Will she survive long enough to answer all the questions, or is she doomed to disappointment … and death?",
      "rating": 4.61,
      "ratings": 922,
      "publicationYear": 2021,
      "availability": "In Stock",
      "genre": "Fantasy",
      "price": "$26"
    }
    ,
    {
      "id": 56860834,
      "url": "https://www.goodreads.com/book/show/56860834-dance-of-a-burning-sea?from_choice=false&from_home_module=false",
      "title": "Dance of a Burning Sea (Mousai, #2)",
      "author": "E.J. Mellow",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1617674382l/56860834.jpg",
      "description": "Within the world of Aadilor, there is a hidden place called the Thief Kingdom, where both magic and pleasure abound. There, the Mousai, a trio of deadly sorceresses bound by oath and blood, use their powers to protect the kingdom’s treasures.nnNiya Bassette brings the potent gift of dance to the Mousai, but behind her tempting twirls, she carries a heavy secret—that the infamous pirate lord, Alōs Ezra, has been threatening to exploit for years. Now banished from the Thief Kingdom for smuggling, Alōs resurfaces in Niya’s life with a plot to hold her hostage, leveraging what he knows to extort a pardon from the Thief King.nnBut Niya makes her own deal with Alōs to guard her secret and guarantee her freedom—yet in doing so binds herself aboard his pirate ship, where she must navigate deadly waters, a bloodthirsty crew, and her own traitorous heart. Soon, a simmering attraction between her and Alōs threatens their delicate truce and makes for a tumultuous ride on the open seas. Far from her kingdom, Niya is entangled in a dangerous dance indeed.nnWelcome to the world of Aadilor, where dark deeds can mask noble hearts and the most alluring of sways often ends with a burn. Care for a spin?nnFrom award-winning author E. J. Mellow comes the thrilling second installment in the Mousai series, featuring a powerful sorceress who finds her loyalties tested by a ruthless pirate lord.",
      "rating": 4.49,
      "ratings": 588,
      "publicationYear": 2021,
      "availability": "Out of Stock",
      "genre": "Fantasy",
      "price": "$30"
    }    
    ,
    {
      "id": 56178856,
      "url": "https://www.goodreads.com/book/show/56178856-junkyard-bargain?from_choice=false&from_home_module=false",
      "title": "Junkyard Bargain (Junkyard Cats, #2)",
      "author": "Faith Hunter",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1614700906l/56178856._SX318_.jpg",
      "description": "Sometimes before you can face your enemies, you need to confront yourself.nnTime is running out for Shining Smith and her crew to gather the weapons they need to rescue one of their own. But will they even make it to the ultimate battle? First, they’ll need to hit the road to Charleston - a hell ride full of bandits, sex slavers, corrupt lawmen, and criminal bike gangs looking to move in on Shining’s territory. nnShining’s human allies will do anything to protect her - because they must. But will victory be worth it if she must compel more and more people to do her bidding? And will her feline warriors, the junkyard cats, remain loyal and risk their lives? Or are they just in it for the kibble?",
      "rating": 4.2,
      "ratings": 884,
      "publicationYear": 2021
    }
    ,
    {
      "id": 56178856,
      "url": "https://www.goodreads.com/book/show/56178856-junkyard-bargain?from_choice=false&from_home_module=false",
      "title": "Junkyard Bargain (Junkyard Cats, #2)",
      "author": "Faith Hunter",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1614700906l/56178856._SX318_.jpg",
      "description": "Sometimes before you can face your enemies, you need to confront yourself.nnTime is running out for Shining Smith and her crew to gather the weapons they need to rescue one of their own. But will they even make it to the ultimate battle? First, they’ll need to hit the road to Charleston - a hell ride full of bandits, sex slavers, corrupt lawmen, and criminal bike gangs looking to move in on Shining’s territory. nnShining’s human allies will do anything to protect her - because they must. But will victory be worth it if she must compel more and more people to do her bidding? And will her feline warriors, the junkyard cats, remain loyal and risk their lives? Or are they just in it for the kibble?",
      "rating": 4.2,
      "ratings": 884,
      "publicationYear": 2021,
      "availability": "In Stock",
      "genre": "Science Fiction",
      "price": "$28"
    }
    ,
    {
      "id": 43526853,
      "url": "https://www.goodreads.com/book/show/43526853-sin-salvation?from_choice=false&from_home_module=false",
      "title": "Sin & Salvation (Demigods of San Francisco, #3)",
      "author": "K.F. Breene",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1547092741l/43526853._SY475_.jpg",
      "description": "Valens has noticed his two missing employees. It won't be long before he knows who is responsible.n nIt won't be long before he claims his vengeance.n nThe race is on. Kieran and Lexi must scrape together an army worthy of taking on the Demigod of San Francisco before he destroys them all.n nBut Valens isn't Lexi's only problem. Mordecai's rapid recovery has been noticed, and he has once again become a threat to his old pack.n nLexi's little family is in jeopardy of being torn apart, and to save them...she must finally embrace what it means to be a Soul Stealer.",
      "rating": 4.47,
      "ratings": 10486,
      "publicationYear": 2019,
      "availability": "In Stock",
      "genre": "Urban Fantasy",
      "price": "$25"
    }
    ,
    {
      "id": 55773332,
      "url": "https://www.goodreads.com/book/show/55773332-saving-time?from_choice=false&from_home_module=false",
      "title": "Saving Time (The Time Police, #3)",
      "author": "Jodi Taylor",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1634217544l/55773332._SY475_.jpg",
      "description": "From the bestselling author of THE CHRONICLES OF ST MARY'S.nnLife is good for Team Weird, now heroes and fully fledged Time Police officers. Luke can't wait to bear arms. Jane has a date. And Matthew still hasn't had his hair cut.nnBut Time waits for no one and neither do criminal masterminds. A major threat to the Timeline is looming, one far deadlier than mere idiots who want to change history. And when a familiar face becomes a Very Important Lead, will conflicting family loyalties spell trouble for Team Weird?nnOne missing. One guilt-ridden. And one facing the end of their Time Police career before it's even begun. Not so good then, after all.nnFOR FANS OF DOCTOR WHO, THE THURSDAY MURDER CLUB AND JASPER FFORDE.",
      "rating": 4.76,
      "ratings": 986,
      "publicationYear": 2021,
      "availability": "Out of Stock",
      "genre": "Science Fiction",
      "price": "$28"
    }
    ,
    {
      "id": 38355410,
      "url": "https://www.goodreads.com/book/show/38355410-elevation?from_choice=false&from_home_module=false",
      "title": "Elevation",
      "author": "Stephen King",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1542040067l/38355410._SX318_.jpg",
      "description": "Although Scott Carey doesn’t look any different, he’s been steadily losing weight. There are a couple of other odd things, too. He weighs the same in his clothes and out of them, no matter how heavy they are. Scott doesn’t want to be poked and prodded. He mostly just wants someone else to know, and he trusts Doctor Bob Ellis.nnIn the small town of Castle Rock, the setting of many of King’s most iconic stories, Scott is engaged in a low grade—but escalating—battle with the lesbians next door whose dog regularly drops his business on Scott’s lawn. One of the women is friendly; the other, cold as ice. Both are trying to launch a new restaurant, but the people of Castle Rock want no part of a gay married couple, and the place is in trouble. When Scott finally understands the prejudices they face–including his own—he tries to help. Unlikely alliances, the annual foot race, and the mystery of Scott’s affliction bring out the best in people who have indulged the worst in themselves and others.",
      "rating": 3.67,
      "ratings": 95144,
      "publicationYear": 2018,
      "availability": "In Stock",
      "genre": "Fiction",
      "price": "$22"
    }
    ,
    {
      "id": 57527488,
      "url": "https://www.goodreads.com/book/show/57527488-deserted?from_choice=false&from_home_module=false",
      "title": "Deserted (Shadow Beast Shifters, #4)",
      "author": "Jaymin Eve",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1630172302l/57527488._SX318_.jpg",
      "description": "A standalone story in the Shadow Beast Shifters world. Best read after Reborn for storyline continuity.nnMelalekin \"Angel\" of the Honor Meadows has been a warrior her entire life. Battle. Death. Loss. They were her constant companions until the day she met Mera Callahan. A shifter who ended up being so much more. A shifter who changed her life, and now... she has been reborn. The scars of her past are gone. Her losses muted under the new life she plans on living.nnThere's just one being standing in her way. A grudge holding desert deity who has made an art form out of making her life hell.nnReece of the Desert Lands is a god unused to being defied, and he has a very long memory when it comes to those who wronged him. Angel is the one he blames for the worst loss in his life, and he'll never let her forget it. Their history is tragic and bloodied, and the pair are set to clash one more time, especially when they end up trapped in the very spot where they lost it all. A meeting of the dynasties in the Delfora, the ancient desert lands, will force them to the place it all began.nnHere they will learn that sometimes the past defines your future. And that there is a fine line between love and hate.nn* This is a standalone in the Shadow Beast world, and does NOT end on a cliffhanger. It is full length at 100k words, and it is advised to read the first three in the Shadow Beast Shifters series first (Rejected, Reclaimed, Reborn). This is an enemies to lovers story, with action, snark, anti-heroes, and steam. It is recommended for 18+ due to storyline and situations.",
      "rating": 4.44,
      "ratings": 2163,
      "publicationYear": 2021,
      "availability": "In Stock",
      "genre": "Paranormal Romance",
      "price": "$27"
    }
    ,
    {
      "id": 52295479,
      "url": "https://www.goodreads.com/book/show/52295479-squad?from_choice=false&from_home_module=false",
      "title": "Squad",
      "author": "Maggie Tokuda-Hall",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1613592358l/52295479.jpg",
      "description": "Pretty Little Liars meets Teen Wolf in this fast-paced, sharply funny, and patriarchy-smashing graphic novel from author Maggie Tokuda-Hall and artist Lisa Sterle. When the new girl is invited to join her high school’s most popular clique, she can’t believe her luck—and she can’t believe their secret, either: they’re werewolves. Fans of Mariko Tamaki and Elana K. Arnold will devour the snappy dialogue, vivid artwork, and timely social commentary.nnWhen Becca transfers to a high school in an elite San Francisco suburb, she’s worried she’s not going to fit in. To her surprise, she’s immediately adopted by the most popular girls in school. At first glance, Marley, Arianna, and Mandy are perfect. But at a party under a full moon, Becca learns that they also have a big secret.nnBecca’s new friends are werewolves. Their prey? Slimy boys who take advantage of unsuspecting girls. Eager to be accepted, Becca allows her friends to turn her into a werewolf, and finally, for the first time in her life, she feels like she truly belongs.nnBut things get complicated when Arianna’s predatory boyfriend is killed, and the cops begin searching for a serial killer. As their pack begins to buckle under the pressure—and their moral high ground gets muddier and muddier—Becca realizes that she might have feelings for one of her new best friends.nnLisa Sterle’s stylish illustrations paired with Maggie Tokuda-Hall’s sharp writing make Squad a fun, haunting, and fast-paced thriller that will resonate with fans of Riverdale, and with readers of This Savage Song, Lumberjanes, and Paper Girls.",
      "rating": 3.97,
      "ratings": 1375,
      "publicationYear": 2021,
      "availability": "In Stock",
      "genre": "Graphic Novel",
      "price": "$20"
    }
    ,
    {
      "id": 49504061,
      "url": "https://www.goodreads.com/book/show/49504061-the-once-and-future-witches?from_choice=false&from_home_module=false",
      "title": "The Once and Future Witches",
      "author": "Alix E. Harrow",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1582634494l/49504061._SY475_.jpg",
      "description": "In 1893, there's no such thing as witches. There used to be, in the wild, dark days before the burnings began, but now witching is nothing but tidy charms and nursery rhymes. If the modern woman wants any measure of power, she must find it at the ballot box.nnBut when the Eastwood sisters--James Juniper, Agnes Amaranth, and Beatrice Belladonna--join the suffragists of New Salem, they begin to pursue the forgotten words and ways that might turn the women's movement into the witch's movement. Stalked by shadows and sickness, hunted by forces who will not suffer a witch to vote-and perhaps not even to live-the sisters will need to delve into the oldest magics, draw new alliances, and heal the bond between them if they want to survive.nnThere's no such thing as witches. But there will be.",
      "rating": 4.08,
      "ratings": 36419,
      "publicationYear": 2020,
      "availability": "In Stock",
      "genre": "Historical Fantasy",
      "price": "$30"
    }
    ,
    {
      "id": 37903770,
      "url": "https://www.goodreads.com/book/show/37903770-norse-mythology?from_choice=false&from_home_module=false",
      "title": "Norse Mythology",
      "author": "Neil Gaiman",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1516128292l/37903770._SX318_.jpg",
      "description": "Neil Gaiman, long inspired by ancient mythology in creating the fantastical realms of his fiction, presents a bravura rendition of the Norse gods and their world from their origin though their upheaval in Ragnarok. nnIn Norse Mythology, Gaiman stays true to the myths in envisioning the major Norse pantheon: Odin, the highest of the high, wise, daring, and cunning; Thor, Odin’s son, incredibly strong yet not the wisest of gods; and Loki—son of a giant—blood brother to Odin and a trickster and unsurpassable manipulator.nnGaiman fashions these primeval stories into a novelistic arc that begins with the genesis of the legendary nine worlds and delves into the exploits of deities, dwarfs, and giants. Through Gaiman’s deft and witty prose, these gods emerge with their fiercely competitive natures, their susceptibility to being duped and to duping others, and their tendency to let passion ignite their actions, making these long-ago myths breathe pungent life again.",
      "rating": 4.08,
      "ratings": 260437,
      "publicationYear": 2017,
      "availability": "In Stock",
      "genre": "Mythology",
      "price": "$25"
    }
    ,
    {
      "id": 58605032,
      "url": "https://www.goodreads.com/book/show/58605032-battle-with-fire?from_choice=false&from_home_module=false",
      "title": "Battle With Fire (Demon Days, Vampire Nights, #11)",
      "author": "K.F. Breene",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1626921452l/58605032._SY475_.jpg",
      "description": "The final book in the Demon Days, Vampire Nights Series!nnWith Lucifer wanting revenge and the elves desperate to hold onto their power, a battle is inevitable.nnThe question is, which side will Reagan choose? The elves have treated her and her friends badly. Lucifer held her captive.nnWill she claim revenge…or will she seek to help balance the worlds? Is that even possible? Regardless, she’s not one to back away from trouble.nnAs the worlds heat up and fates are realized, Regan’s future is anything but decided.",
      "rating": 4.78,
      "ratings": 2849,
      "publicationYear": 2021,
      "availability": "In Stock",
      "genre": "Paranormal Fantasy",
      "price": "$22"
    }
    ,
    {
      "id": 58759747,
      "url": "https://www.goodreads.com/book/show/58759747-escape-from-falaise?from_choice=false&from_home_module=false",
      "title": "Escape from Falaise (Ranger's Apprentice: The Royal Ranger #5)",
      "author": "John Flanagan",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1628840621l/58759747._SY475_.jpg",
      "description": "The stakes have never been higher for the Rangers of Araluen in the New York Times bestselling series.nnWill and Maddie are imprisoned at Chateau des Falaises. Baron Lassigny is scheming to recruit them as spies for hire, but Maddie raises the stakes when she challenges Lassigny’s garrison commander to a duel on horseback. Will is horrified – especially when he realises the treacherous baron won't fight fair.nnIf Maddie can survive the duel, they still need to escape the heavily guarded chateau and rescue the kidnapped prince they were sent to retrieve. It will take all their ingenuity, courage and determination to triumph this time – and to solve the mystery of who betrayed them.",
      "rating": 4.33,
      "ratings": 222,
      "publicationYear": 2021,
      "availability": "In Stock",
      "genre": "Young Adult, Fantasy",
      "price": "$18"
    }
    ,
    {
      "id": 57226569,
      "url": "https://www.goodreads.com/book/show/57226569-the-keepers-of-metsan-valo?from_choice=false&from_home_module=false",
      "title": "The Keepers of Metsan Valo",
      "author": "Wendy Webb",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1615066863l/57226569._SY475_.jpg",
      "description": "The spirits of Nordic folklore come calling in this entrancing tale of family secrets and ancient mysteries by the #1 Amazon Charts bestselling author of The Haunting of Brynn Wilder.nnIn Metsan Valo, her family home on Lake Superior, Anni Halla’s beloved grandmother has died. Among her fond memories, what Anni remembers most vividly is her grandmother’s eerie yet enchanting storytelling. By firelight she spun tall tales of spirits in the nearby forest and waters who could heal—or harm—on a whim. But of course those were only stories…nnThe reading of the will now occasions a family reunion. Anni and her twin brother, their almost otherworldly mother, and relatives Anni hasn’t seen in forever—some with good reason—are all brought back together under one roof that strains to hold all their tension. But it’s not just Annie’s family who is unsettled. Whispers wind through the woods. Laughter bursts from bubbling streams. Raps from unseen hands rupture on the walls. Fireflies swarm and nightmares stir. With each odd occurrence, Anni fears that her return has invited less a welcoming and more a warning.nnWhen another tragedy strikes near home, Anni must dive headfirst into the mysterious happenings to discover the truth about her home, her family, and the wooded island’s ancient lore. Plunging into the past may be the only way to save her family from whatever bedevils Metsan Valo.",
      "rating": 4.15,
      "ratings": 718,
      "publicationYear": 2021,
      "availability": "In Stock",
      "genre": "Mystery, Fantasy",
      "price": "$28"
    }
    ,
    {
      "id": 30969741,
      "url": "https://www.goodreads.com/book/show/30969741-an-enchantment-of-ravens?from_choice=false&from_home_module=false",
      "title": "An Enchantment of Ravens",
      "author": "Margaret Rogerson",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1486244049l/30969741._SY475_.jpg",
      "description": "Every enchantment has a price.nnWith a flick of her paintbrush, Isobel creates stunning portraits for a dangerous set of clients: the fair folk. These immortal creatures cannot bake bread or put a pen to paper without crumbling to dust. They crave human Craft with a terrible thirst, and they trade valuable enchantments for Isobel’s paintings. But when she receives her first royal patron—Rook, the autumn prince—Isobel makes a deadly mistake. She paints mortal sorrow in his eyes, a weakness that could cost him his throne, and even his life.nnFurious, Rook spirits Isobel away to his kingdom to stand trial for her crime. But something is seriously amiss in his world, and they are attacked from every side. With Isobel and Rook depending upon each other for survival, their alliance blossoms into trust, perhaps even love . . . a forbidden emotion that would violate the fair folks’ ruthless laws, rendering both their lives forfeit. What force could Isobel's paintings conjure that is powerful enough to defy the ancient malice of the fairy courts?nnIsobel and Rook journey along a knife-edge in a lush world where beauty masks corruption and the cost of survival might be more frightening than death itself.",
      "rating": 3.65,
      "ratings": 57843,
      "publicationYear": 2017,
      "availability": "In Stock",
      "genre": "Fantasy, Romance",
      "price": "$20"
    }
    ,
    {
      "id": 40291564,
      "url": "https://www.goodreads.com/book/show/40291564-storm-and-fury?from_choice=false&from_home_module=false",
      "title": "Storm and Fury (The Harbinger, #1)",
      "author": "Jennifer L. Armentrout",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1540397329l/40291564.jpg",
      "description": "Eighteen-year-old Trinity Marrow may be going blind, but she can see and communicate with ghosts and spirits. Her unique gift is part of a secret so dangerous that she’s been in hiding for years in an isolated compound fiercely guarded by Wardens—gargoyle shape-shifters who protect humankind from demons. If the demons discover the truth about Trinity, they’ll devour her, flesh and bone, to enhance their own powers.nnWhen Wardens from another clan arrive with disturbing reports that something out there is killing both demons and Wardens, Trinity’s safe world implodes. Not the least because one of the outsiders is the most annoying and fascinating person she’s ever met. Zayne has secrets of his own that will upend her world yet again—but working together becomes imperative once demons breach the compound and Trinity’s secret comes to light. To save her family and maybe the world, she’ll have to put her trust in Zayne. But all bets are off as a supernatural war is unleashed…",
      "rating": 4.12,
      "ratings": 28235,
      "publicationYear": 2019
    }
    ,
    {
      "id": 57300278,
      "url": "https://www.goodreads.com/book/show/57300278-dead-lands?from_choice=false&from_home_module=false",
      "title": "Dead Lands (Savage Lands, #3)",
      "author": "Stacey Marie Brown",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1620998483l/57300278._SY475_.jpg",
      "description": "Kidnapped by the notorious rebel group, Provstat, Brexley finds her connection goes deeper than she ever imagined. Reunited with old acquaintances and an uncle she never knew, Brexley is thrown into the vicious world of politics, where human and fae leaders will do anything to come out on top. Here dangerous associations and meticulous plots are far more dangerous and cutthroat than any game she survived in Halálház.nnIf her life wasn’t complicated enough, her relationship with the infamous legend is growing stronger. The more she tries to untangle the link between Warwick and her, the thicker it wraps around them both, entwining them in a world between life and death, where brutal passion and fury collide.nnWhen whispers of a coveted magical substance, called the nectar, start buzzing louder, Brexley’s strange bond to the fae book leads her on an unexpected journey. One that brings her closer to the answers she seeks.nnBut once she opens the door, all the secrets and lies of her past come flooding out.nnTruths she’s not ready to face.nnAnd betrayals that cut bone deep.",
      "rating": 4.34,
      "ratings": 3945,
      "publicationYear": 2021
    },
    {
      "id": 59058892,
      "url": "https://www.goodreads.com/book/show/59058892-apex-basilisk?from_choice=false&from_home_module=false",
      "title": "Apex Basilisk (Big Bad Basilisks, #1)",
      "author": "Terry Bolryder",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1632379358l/59058892._SY475_.jpg",
      "description": "For most of his life, Gunnar the basilisk has spent his time as a gigantic, fearsome monster, defending the wild Texas landscape from invaders and rival shifters. Now that he and the other basilisks have awakened into the modern world, they’re on a new mission: to find mates, and help bring peace to a world growing more chaotic by the day. But when a simple assignment in a small town brings the stoic, silent Gunnar face to face with an easily-frightened woman in dire need of his protection, the beast inside him roars to stay by her side, whether she likes it or not.nnApril Nelson’s life in the quiet town of Clawson’s Creek is anything but normal. For starters, shifters aren’t a secret to the humans there. And to make things worse, the bear and wolf shifters living in town have been fighting for years. When the feud leads to a deadly attack that nearly kills her, she finds an unexpected ally in a tall, gorgeous man with one red eye and one blue eye. Gunnar, the basilisk, a man of strength and secrets, whose handsomeness is matched only by his obsession with protecting her. Even against her own wishes.nnWhen it’s clear Gunnar isn’t going to leave her alone with a town full of angry shifters fast on her heels, all April can do is let him into her life. But Gunnar has found his mate, and between saving her life multiple times, and heated nights beneath the autumn sky, the attraction and the drama between the two of them is reaching a fever pitch. And though April may have found her new reason to carry on with her difficult life, the forces clashing in Clawson’s Creek look like they won’t permit her a happy ending until her basilisk protector has dealt with all of them.",
      "rating": 4.44,
      "ratings": 755,
      "publicationYear": 2021
    },
    {
      "id": 58883456,
      "url": "https://www.goodreads.com/book/show/58883456-the-dark-bond?from_choice=false&from_home_module=false",
      "title": "The Dark Bond (Vampire Hunter Society, #2)",
      "author": "Leia Stone",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1630263947l/58883456._SY475_.jpg",
      "description": "Everything I thought I knew was a lie. The evil vampire spawn I'd hunted my entire life have turned out to be my only allies. Hidden away in Magic City, I've promised to help support Luka as he competes to become King.nnThe problem? I'm falling for him and he's engaged to be married.nnTo get my mind off of my boy problem, Liv and I band together with our allies to dig deeper into the betrayal of every hunter. What I find shocks me to my core.nnWith Luka's fiancé breathing down my neck, and hidden truths bubbling to the surface daily, it will take every skill I have to stay alive.",
      "rating": 4.42,
      "ratings": 931,
      "publicationYear": 2021
    },
    {
      "id": 58109305,
      "url": "https://www.goodreads.com/book/show/58109305-unexpected-heat?from_choice=false&from_home_module=false",
      "title": "Unexpected Heat (Dragon Goddess #3)",
      "author": "Sedona Ashe",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1621563952l/58109305._SY475_.jpg",
      "description": "Things are falling apart.nI’ve been betrayed and captured, but that’s not even the worst part…nI’m in heat. Three hundred years early.nnWhen I get my hands on those who betrayed me, I’m going to punt their butts over the dang moon! First, though, I need to work on escaping this dungeon while also surviving the torture by the traitors trying to steal my power.nnIdiots. Just wait until I get my hands on a blade.nnAfter merging with Beasty, I was left struggling to handle the onslaught of power as my dragon instincts spun out of control. I’ve been betrayed by someone I trusted, and now I’m being held in a dungeon straight out of a movie.nnTo make matters worse, I’m in heat. My early heat—300 years early, to be exact. Without my yummy mates to ease the heat, the dragon’s instinct to mate is becoming unbearable. Between the torture and the heat, my body is growing weaker with each passing day. How much longer before the heat makes me lose control?nnThe only one showing me any kindness is the mysterious pointy-eared guard… but what exactly is he? And can I take another mate without knowing anything about him? If I want to survive, I may have to take another mate before I become too weak to escape. It’s not just my life that is at stake.nnI might have someone else needing my protection now…nnWhen I finally get free, there will be no more suppressing my powers. I will never be held captive or separated from my mates again. I will emerge an avenging Queen ready to take back her kingdom.nnWith the roaring ocean and flashing lightning responding to my commands, nothing will stop this goddess! The Dragoness of the Sea has awakened.nnI’m going to get revenge. I’m going to win, no matter the cost.nIf you are in my way, you better move./i>nBecause nothing is going to stop me. Nothing.nnThis queen’s coming for her crown. nnThere’s fire and steam in this paranormal dragon romance. This is the final book in the series, and there will be a happily ever after ending.",
      "rating": 4.43,
      "ratings": 438,
      "publicationYear": 2021
    },
    {
      "id": 59248825,
      "url": "https://www.goodreads.com/book/show/59248825-the-werewolf-s-15-minutes?from_choice=false&from_home_module=false",
      "title": "The Werewolf's 15 Minutes",
      "author": "Jonathan Maberry",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1633825848l/59248825._SX318_.jpg",
      "description": "Gary Bruce is a slacker of epic loserness. Can't keep a job. His friends are as bad as he is. No girlfriend. No direction.nnGary Bruce is also a werewolf.nnDesperate for any kind of success, Gary decides to out himself on You Tube. The moment this ordinary guy goes full-on fur, fangs, and claws, the world can't get enough of the biggest thing on social media, he's on every talk show, book and movie deals fall in his lap, and for the first time in his life he gets invited to all the best parties.nnBut celebrity is a special kind of voracious monster. And when Gary's star begins to lose its luster, he has to decide how far he'll go to stay relevant in a world that discards has-beens in favor of the next bit thing.nnFortunately, Gary has a plan....nnn  'THE WEREWOLF'S 15 MINUTES'n is a brand-new short story by 'New York Times' best seller and five-time 'Bram Stoker Award' winner Jonathan Maberry, author of 'Bewilderness' and 'V-Wars' (NetFlix).nnn©2021 Jonathan Maberry Productions, LLC (P)2021 Audible Originals, LLC.",
      "rating": 3.86,
      "ratings": 98,
      "publicationYear": 2021
    },
    {
      "id": 58088499,
      "url": "https://www.goodreads.com/book/show/58088499-he-who-fights-with-monsters-3?from_choice=false&from_home_module=false",
      "title": "He Who Fights with Monsters 3 (He Who Fights with Monsters, #3)",
      "author": "Shirtaloon",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1621351547l/58088499._SX318_.jpg",
      "description": "For all that Jason’s new life is amazing, he is about to learn that his new power, wealth, and influence comes at a price...nnRiding high on success, he and his team are looking to the future, preparing themselves for the challenges to come. Nothing, however, could prepare him for the lessons his enemies have to teach. When magic is involved, the stakes can be even greater than life and death.nnWhile Jason’s personal enemies make plans, the greater foes plaguing his new home have been pushed to the brink. With one powerful card left to play, they are on a collision course with Jason and his team. With no one to help and more than their lives on the line, Jason and his companions must fight with more monsters than ever in the race to grow stronger. With an invincible enemy already anticipating them, they will learn that sometimes winning the battle is more important than surviving it.",
      "rating": 4.55,
      "ratings": 2860,
      "publicationYear": 2021
    },
    {
      "id": 57050466,
      "url": "https://www.goodreads.com/book/show/57050466-unexpected-shift?from_choice=false&from_home_module=false",
      "title": "Unexpected Shift (Dragon Goddess, #1)",
      "author": "Sedona Ashe",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1613242199l/57050466._SY475_.jpg",
      "description": "n  They took everything from her. Now, her true nature will take over. When the time comes, will she be able to handle it?nnnTia’s life has always been sheltered. However, one night is enough to destroy everything she once knew. Suddenly, she has to run for her life and fight for her survival. And just when things couldn’t get any worse, those twin wolves become her saviors… and then mark her!nnTia is forced into a world she never expected. Strange forces pull her towards the twins and the sexy Alpha of the WaterStone pack. But the strangest thing of all is the change within her… Something powerful has been asleep inside of Tia, lurking in the shadows. nnNow, the time has come for the awakening of the Dragoness. Will Tia be ready to accept her true nature?nnHowever, if she wants to unlock her true potential and save the world, she must first choose her mate… or mates. Who will accept her nature and love her for who she really is? The mysterious vampire Mithraheal, the brooding Alpha Cage, or the loyal werewolf twins, Luke and Levi? nnSometimes, finding your true mates means to let yourself free to experience new things, but is Tia ready to accept this?nnn  This is a reverse harem (why choose), paranormal romance with werewolves, wizards, vampires.... and one slightly stabby and very sarcastic, dragon shifting goddess! This book is full of humor, and scenes that will steam up your glasses.nn**Due to the sexy scenes, this is an 18+ only book**n",
      "rating": 4.13,
      "ratings": 1092,
      "publicationYear": 2021
    },
    {
      "id": 58421005,
      "url": "https://www.goodreads.com/book/show/58421005-broken-moon?from_choice=false&from_home_module=false",
      "title": "Broken Moon (Kait Silver, #1)",
      "author": "Laken Cane",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1624604102l/58421005._SY475_.jpg",
      "description": "I'm a wolf shifter... who can't shift.nnTwelve years ago, I was hobbled by my alpha, cast out of my pack, and forced into an unfriendly world without any protection. nnBut I’m not exactly helpless.nnDespite being unable to shift, I have talents the others don't have. I can see the spirits of dead people, for one. And I have a knack for fighting rogue supernaturals.nnMy ex-alpha will never let me back in, but there's another alpha in the city. nnSomething has been killing his wolves, and he wants me to destroy it before it takes another one. He'll triple my going rate--but that's not the thing that makes me agree to help him.nnHe says he can free my wolf.nnIt's not possible, but...nWhat if it is?nnI'll help him, either way. Monster hunting is what I do, and if there's a monster killing wolves, I will stop it. Because those two warring alphas might believe the city is theirs, but this is my territory.nnThe city embraced me when the packs wouldn't have me, and I will protect it--with or without my wolf.",
      "rating": 4.21,
      "ratings": 1362,
      "publicationYear": 2021
    },
    {
      "id": 59126265,
      "url": "https://www.goodreads.com/book/show/59126265-system-return?from_choice=false&from_home_module=false",
      "title": "System Return (Natural Laws Apocalypse Book 2)",
      "author": "Tom Larcombe",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1633104728l/59126265._SX318_.jpg",
      "description": "After the discovery that the encampment outside of his Safe Zone is full of friendlies, Marc and his group finally have a chance to try to grow stronger again. The addition of an administrator for the Safe Zone as well as someone to coordinate its defenses finally allows Marc to feel like he can go out and do other things.nnWith the number of survivors they're finding in the immediate area rapidly dwindling, they choose to go farther afield, working on gaining additional resources for the Safe Zone while searching out any remaining survivors they can find.nnHis father reported passing other Safe Zones on his way back to town so Marc decides some investigation is in order. What he intends is to salvage the ruins of a destroyed Safe Zone his father spotted and offer trade and cordial relations to the surviving one that's closer by. What occurs is not what he intended or expected.nnWith the possibility of a technology upgrade for his Safe Zone, what appears to be a community of some sort of elves a few miles south of the Safe Zone, and the sneaking suspicion that the System itself is merely a tool for someone, or something, else, Marc isn't quite as free to just do what he wants as he thought he'd be at this point.nnThis story is approximately 157,000 words long and DRM free.",
      "rating": 4.58,
      "ratings": 723,
      "publicationYear": 2021
    },
    {
      "id": 58522048,
      "url": "https://www.goodreads.com/book/show/58522048-the-dark-bite?from_choice=false&from_home_module=false",
      "title": "The Dark Bite (Vampire Hunter Society, #1)",
      "author": "Leia Stone",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1625846297l/58522048._SY475_.jpg",
      "description": "Vampires are the spawn of the devil. Evil to the core... or so I thought, until one of them saves my life.nnAs a member of the House of Rose, a division of the Vampire Hunter Society, I've got one of the highest kill records on file. I track my mark and don't stop until the job is done.nnThat is, until my mark saves my life. Luka Drake isn't like the vampires I've been hunting for the past five years, and despite the fact that he's a vampire prince fresh out of Magic City Prison for committing God knows what crime, I can't kill him.nnMy only other option is to walk away and pretend our paths never crossed. I'm about to pull it off but Luka pulls me back, and in the worst way possible, in a way that changes everything.nnThis is a full-length slow burn paranormal romance for readers that love Jaymin Eve, Linsey Hall and K.F. Breene.",
      "rating": 4.38,
      "ratings": 1336,
      "publicationYear": 2021
    },
    {
      "id": 58873741,
      "url": "https://www.goodreads.com/book/show/58873741-ascendance-of-a-bookworm?from_choice=false&from_home_module=false",
      "title": "Ascendance of a Bookworm: Part 4 Volume 3",
      "author": "Miya Kazuki",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1630141088l/58873741._SX318_.jpg",
      "description": "After reuniting with Ferdinand and the others, Rozemyne returns to the temple and assiduously resumes her duties as the High Bishop. There is much for her to do—whether that be participating in the Dedication Ritual, supporting the printing industry, attending numerous meetings, or tackling a mountain of paperwork—and she soon finds her days as busy as ever.nEven as winter starts drawing to a close, Rozemyne’s world continues to change. The conclusion to her first year in the Royal Academy sees her forced into a tea party with all the other duchies, and the sixth-years among her retainers prepare to graduate. Discussions even begin to focus on Rozemyne’s future engagement, which will one day play a crucial role in the growth of the duchy.",
      "rating": 4.65,
      "ratings": 248,
      "publicationYear": 2018
    },
    {
      "id": 58679573,
      "url": "https://www.goodreads.com/book/show/58679573-untamed-fate?from_choice=false&from_home_module=false",
      "title": "Untamed Fate (Magic Side: Wolf Bound #2)",
      "author": "Veronica Douglas",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1630862385l/58679573._SY475_.jpg",
      "description": "Last week I was a waitress. Now I’m turning into a monster.nnNo one knows the truth, except the faceless man—a twisted sorcerer who’s hellbent on stealing my soul.nnWith secrets and danger close on my heels, the only one who can help me tame my inner beast is Jaxson Laurent—the Chicago alpha. Our chemistry is explosive, but the rift between our families runs too deep.nnDo I dare trust him? The last time we worked together I barely escaped with my life. And if it comes down to choosing me or his pack, I know who he’ll pick.nnTime is ticking, and my life is hanging in the balance. We must unmask the faceless man before he brings darkness down on us all.nnAn action-packed urban fantasy, Untamed Fate features a kick-ass heroine, a dangerous alpha hero, and a steamy slow-burn, enemies-to-lovers romance.nnPrepare to be drawn into a mysterious and magical world, full of demons, shifters, and sorcerers.nnThis story is set in the wider Dragon’s Gift universe created by Linsey Hall, and if you enjoyed the archaeology, history, and daring in her books, this adventure is for you!",
      "rating": 4.34,
      "ratings": 689,
      "publicationYear": 2021
    },
    {
      "id": 58909525,
      "url": "https://www.goodreads.com/book/show/58909525-black-arts-white-craft?from_choice=false&from_home_module=false",
      "title": "Black Arts, White Craft (Black Hat Bureau, #2)",
      "author": "Hailey Edwards",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1630551895l/58909525._SY475_.jpg",
      "description": "After a black witch pitched a hissy fit in Hollis Apothecary, Rue got stuck cleaning up his mess. That was the easy part. Repairing the damage he inflicted on Camber and Arden? That makes Rue wish she could bring him back to life just to kill him again. Slower this time.nnWhile Rue is setting her new life back to rights, Clay and Asa are off working a case, but it soon becomes clear that they’ll need her help to catch the vicious creature preying on locals in a small Tennessee town. She’s got her hands full at home, but Rue has no choice. She must report for duty to honor her agreement with the director. Or else.nnWhat she discovers leads her deeper down the rabbit hole of Black Hat Bureau corruption and promises that, no matter how grim the past few weeks have been, the worst is yet to come.",
      "rating": 4.48,
      "ratings": 1426,
      "publicationYear": 2021
    },
    {
      "id": 55811674,
      "url": "https://www.goodreads.com/book/show/55811674-serendipity?from_choice=false&from_home_module=false",
      "title": "Serendipity (Bayou Magic #3)",
      "author": "Kristen Proby",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1603830113l/55811674._SY475_.jpg",
      "description": "From New York Times bestselling author, Kristen Proby, comes Serendipity, the final installment in her gripping Bayou Magic series…nnMy sight is a gift and also a curse. It cost me the love of my life. We may have been young, but some things you don’t get over. Like being the cause of the biggest tragedy of your boyfriend’s life. It’s something I’ll never forget, and a reflection of who I am.nnBut now that Jackson’s back in town, with scars and a hero’s badge of honor, it’s time for me to be brave, too.nnA malevolent evil hell-bent on making my sisters and me pay for rebuffing him is still stalking my family, and some ancient writings portended that the six were the only ones who could defeat him.nnJackson Pruitt and I round out that magical number, which means I have to face the evil and the things Jack makes me feel, to save my family and my city.nnI never sought to reconnect with Jack. Working with him now means opening myself up to my feelings for him.nnRefusing means destruction for us all.",
      "rating": 4.43,
      "ratings": 603,
      "publicationYear": 2021
    },
    {
      "id": 26252859,
      "url": "https://www.goodreads.com/book/show/26252859-the-hidden-oracle?from_choice=false&from_home_module=false",
      "title": "The Hidden Oracle (The Trials of Apollo, #1)",
      "author": "Rick Riordan",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1449765273l/26252859.jpg",
      "description": "How do you punish an immortal?nnBy making him human.nnAfter angering his father Zeus, the god Apollo is cast down from Olympus. Weak and disorientated, he lands in New York City as a regular teenage boy. Now, without his godly powers, the four-thousand-year-old deity must learn to survive in the modern world until he can somehow find a way to regain Zeus's favour.nnBut Apollo has many enemies—gods, monsters and mortals who would love to see the former Olympian permanently destroyed. Apollo needs help, and he can think of only one place to go... an enclave of modern demigods known as Camp Half-Blood.",
      "rating": 4.19,
      "ratings": 138530,
      "publicationYear": 2016
    },
    {
      "id": 51118201,
      "url": "https://www.goodreads.com/book/show/51118201-the-haunting-of-brynn-wilder?from_choice=false&from_home_module=false",
      "title": "The Haunting of Brynn Wilder",
      "author": "Wendy     Webb",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1592339832l/51118201._SY475_.jpg",
      "description": "After a devastating loss, Brynn Wilder escapes to Wharton, a tourist town on Lake Superior, to reset. Checking into a quaint boardinghouse for the summer, she hopes to put her life into perspective. In her fellow lodgers, she finds a friendly company of strangers: the frail Alice, cared for by a married couple with a heartbreaking story of their own; LuAnn, the eccentric and lovable owner of the inn; and Dominic, an unsettlingly handsome man inked from head to toe in mesmerizing tattoos.nnBut in this inviting refuge, where a century of souls has passed, a mystery begins to swirl. Alice knows things about Brynn, about all of them, that she shouldn’t. Bad dreams and night whispers lure Brynn to a shuttered room at the end of the hall, a room still heavy with a recent death. And now she’s become irresistibly drawn to Dominic—even in the shadow of rumors that wherever he goes, suspicious death follows.nnIn this chilling season of love, transformation, and fear, something is calling for Brynn. To settle her past, she may have no choice but to answer.",
      "rating": 3.88,
      "ratings": 21208,
      "publicationYear": 2020
    },
    {
      "id": 58566730,
      "url": "https://www.goodreads.com/book/show/58566730-blood-magic?from_choice=false&from_home_module=false",
      "title": "Blood Magic (Kait Silver, #2)",
      "author": "Laken Cane",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1626433979l/58566730._SY475_.jpg",
      "description": "My new alpha did the impossible. He freed my hobbled wolf.nnAnd though I've craved a pack and an alpha since I was a rejected kid, I rebel against being anything less than his equal--even as my wolf worships the very ground he walks on. It makes for an interesting dynamic.nnFlung headfirst into the supernaturals' world, I am no longer a lonely, agonized outcast running from the moon. My power is growing, I have amazing people around me, and the grateful mayor has set me up with an office and a legitimate job.nnFor a minute, everything is quiet. Too quiet. Even the demon seems to have disappeared. And all that peace is just a little unsettling.nnBut then a human hires me to go after the vampires--specifically the county master--and my world explodes into chaos.nnGood thing I like chaos.nnBut when the demon returns with a vengeance, the council makes me an offer I don't want to refuse, and an infamous and scary as hell hunter blows into my life, the peace and quiet starts looking pretty damn good...",
      "rating": 4.34,
      "ratings": 968,
      "publicationYear": 2021
    },
    {
      "id": 56898241,
      "url": "https://www.goodreads.com/book/show/56898241-grave-reservations?from_choice=false&from_home_module=false",
      "title": "Grave Reservations (The Booking Agents #1)",
      "author": "Cherie Priest",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1634487594l/56898241.jpg",
      "description": "A psychic travel agent and a Seattle PD detective solve a murder in this quirky mystery in the vein of Lisa Lutz’s The Spellman Files and Charlaine Harris’s Aurora Teagarden series.Meet Leda Foley: devoted friend, struggling travel agent, and inconsistent psychic. When Leda, sole proprietor of Foley's Flights of Fancy, impulsively re-books Seattle PD detective Grady Merritt’s flight, her life changes in ways she couldn’t have predicted.  After watching his original plane blow up from the safety of the airport, Grady realizes that Leda’s special abilities could help him with a cold case he just can’t crack.  Despite her scattershot premonitions, she agrees for a secret reason: her fiancé’s murder remains unsolved. Leda’s psychic abilities couldn’t help the case several years before, but she’s been honing her skills and drawing a crowd at her favorite bar’s open-mic nights, where she performs Klairvoyant Karaoke—singing whatever song comes to mind when she holds people’s personal effects. Now joined by a rag-tag group of bar patrons and pals alike, Leda and Grady set out to catch a killer—and learn how the two cases that haunt them have more in common than they ever suspected.",
      "rating": 3.88,
      "ratings": 511,
      "publicationYear": 2021
    },
    {
      "id": 57099601,
      "url": "https://www.goodreads.com/book/show/57099601-once-upon-a-wardrobe?from_choice=false&from_home_module=false",
      "title": "Once Upon a Wardrobe",
      "author": "Patti Callahan",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1616161736l/57099601.jpg",
      "description": "From Patti Callahan, the bestselling author of Becoming Mrs. Lewis, comes another enchanting story that pulls back the curtain on the early life of C. S. Lewis.nnn  “Where did Narnia come from?”nnnn  The answer will change everything.nnnMegs Devonshire is brilliant with numbers and equations, on a scholarship at Oxford, and dreams of solving the greatest mysteries of physics.nnShe prefers the dependability of facts—except for one: the younger brother she loves with all her heart doesn’t have long to live. When George becomes captivated by a copy of a brand-new book called The Lion, the Witch and the Wardrobe and begs her to find out where Narnia came from, there’s no way she can refuse.nnDespite her timidity about approaching the famous author, Megs soon finds herself taking tea with the Oxford don and his own brother, imploring them for answers. What she receives instead are more stories . . . stories of Jack Lewis’s life, which she takes home to George.nnWhy won’t Mr. Lewis just tell her plainly what George wants to know? The answer will reveal to Meg many truths that science and math cannot, and the gift she thought she was giving to her brother—the story behind Narnia—turns out to be his gift to her, instead: hope.nnPraise for Once Upon a Wardrobe: nn“I advise you to read this book, then wait for a while and then read it again, for while it may not be Narnia, there is magic in it.” —Douglas Gresham, C. S. Lewis’s stepsonnnnnNew York Times bestselling authornAlso by Patti Callahan: Becoming Mrs. Lewis and Surviving SavannahnnIncludes discussion questions for book clubs as well as a note from Douglas Gresham, C. S. Lewis’s stepson",
      "rating": 4.62,
      "ratings": 678,
      "publicationYear": 2021
    },
    {
      "id": 53426743,
      "url": "https://www.goodreads.com/book/show/53426743-covet?from_choice=false&from_home_module=false",
      "title": "Covet (Crave, #3)",
      "author": "Tracy Wolff",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1612742255l/53426743.jpg",
      "description": "I may have reached my breaking point. As if trying to graduate from a school for supernaturals isn’t stressful enough, my relationship status has gone from complicated to a straight-up dumpster fire. Oh, and the Bloodletter has decided to drop a bomb of epic proportions on us all... Then again, when has anything at Katmere Academy not been intense?nnAnd the hits just keep coming. Jaxon's turned colder than an Alaskan winter. The Circle is splintered over my upcoming coronation. As if things couldn’t get worse, now there’s an arrest warrant for Hudson’s and my supposed crimes—which apparently means a lifetime prison sentence with a deadly unbreakable curse.nnChoices will have to be made...and I fear not everyone will survive.",
      "rating": 4.3,
      "ratings": 12253,
      "publicationYear": 2021
    },
    {
      "id": 56311471,
      "url": "https://www.goodreads.com/book/show/56311471-the-beatryce-prophecy?from_choice=false&from_home_module=false",
      "title": "The Beatryce Prophecy",
      "author": "Kate DiCamillo",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1611556552l/56311471.jpg",
      "description": "From two-time Newbery Medalist Kate DiCamillo and two-time Caldecott Medalist Sophie Blackall comes a fantastical meditation on fate, love, and the power of words to spell the world.nnWe shall all, in the end, be led to where we belong. We shall all, in the end, find our way home.nnIn a time of war, a mysterious child appears at the monastery of the Order of the Chronicles of Sorrowing. Gentle Brother Edik finds the girl, Beatryce, curled in a stall, wracked with fever, coated in dirt and blood, and holding fast to the ear of Answelica the goat. As the monk nurses Beatryce to health, he uncovers her dangerous secret, one that imperils them all--for the king of the land seeks just such a girl, and Brother Edik, who penned the prophecy himself, knows why.nnAnd so it is that a girl with a head full of stories--powerful tales-within-the-tale of queens and kings, mermaids and wolves--ventures into a dark wood in search of the castle of one who wishes her dead. But Beatryce knows that, should she lose her way, those who love her--a wild-eyed monk, a man who had once been king, a boy with a terrible sword, and a goat with a head as hard as stone--will never give up searching for her, and to know this is to know everything. With its timeless themes, unforgettable cast, and magical medieval setting, Kate DiCamillo's lyrical tale, paired with resonant black-and-white illustrations by Caldecott Medalist Sophie Blackall, is a true collaboration between masters.",
      "rating": 4.43,
      "ratings": 1025,
      "publicationYear": 2021
    },
    {
      "id": 58313805,
      "url": "https://www.goodreads.com/book/show/58313805-bite-me?from_choice=false&from_home_module=false",
      "title": "Bite Me (Shadow Guild: Vampire Bride #1)",
      "author": "Linsey Hall",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1623412455l/58313805._SY475_.jpg",
      "description": "I’ve got one thing to say to the fated mate who wants to kill me: Bite Me.nnI can handle anyone who walks into my pub. Except him--the most powerful vampire who ever lived. The First. Dark, damaged, and hot as hell. He says I’m his one and only Vampire Bride, and that five years ago, I buried him alive.nnObviously he’s crazy, because I don’t remember any of that. All I know is that if I want to escape his vengeance, I have to help him infiltrate a deadly secret society.nnI’m going to use the time to prove that I didn’t try to murder him, and that I’m not his Vampire Bride. Because if I am, he’ll be forced to kill me. But we're like colliding stars, and the heat is irresistible. As the danger thickens, I start to wonder if maybe I did kill him. Whatever happens in the end, there’s no escaping our twisted fate.nnIf you like kickbutt heroines, powerful heroes, humor, and enemies-to-lovers, then check out Bite Me, the first book in the Vampire Bride series.",
      "rating": 4.27,
      "ratings": 1990,
      "publicationYear": 2021
    },
    {
      "id": 25489134,
      "url": "https://www.goodreads.com/book/show/25489134-the-bear-and-the-nightingale?from_choice=false&from_home_module=false",
      "title": "The Bear and the Nightingale (The Winternight Trilogy, #1)",
      "author": "Katherine Arden",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1611440212l/25489134._SX318_.jpg",
      "description": "At the edge of the Russian wilderness, winter lasts most of the year and the snowdrifts grow taller than houses. But Vasilisa doesn't mind—she spends the winter nights huddled around the embers of a fire with her beloved siblings, listening to her nurse's fairy tales. Above all, she loves the chilling story of Frost, the blue-eyed winter demon, who appears in the frigid night to claim unwary souls. Wise Russians fear him, her nurse says, and honor the spirits of house and yard and forest that protect their homes from evil.nnAfter Vasilisa's mother dies, her father goes to Moscow and brings home a new wife. Fiercely devout, city-bred, Vasilisa's new stepmother forbids her family from honoring the household spirits. The family acquiesces, but Vasilisa is frightened, sensing that more hinges upon their rituals than anyone knows.nnAnd indeed, crops begin to fail, evil creatures of the forest creep nearer, and misfortune stalks the village. All the while, Vasilisa's stepmother grows ever harsher in her determination to groom her rebellious stepdaughter for either marriage or confinement in a convent.nnAs danger circles, Vasilisa must defy even the people she loves and call on dangerous gifts she has long concealed—this, in order to protect her family from a threat that seems to have stepped from her nurse's most frightening tales.nnThe Bear and the Nightingale is a magical debut novel from a gifted and gorgeous voice. It spins an irresistible spell as it announces the arrival of a singular talent.",
      "rating": 4.08,
      "ratings": 152109,
      "publicationYear": 2017
    },
    {
      "id": 43521657,
      "url": "https://www.goodreads.com/book/show/43521657-the-ten-thousand-doors-of-january?from_choice=false&from_home_module=false",
      "title": "The Ten Thousand Doors of January",
      "author": "Alix E. Harrow",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1548174710l/43521657.jpg",
      "description": "In a sprawling mansion filled with peculiar treasures, January Scaller is a curiosity herself. As the ward of the wealthy Mr. Locke, she feels little different from the artifacts that decorate the halls: carefully maintained, largely ignored, and utterly out of place.nnThen she finds a strange book. A book that carries the scent of other worlds, and tells a tale of secret doors, of love, adventure and danger. Each page turn reveals impossible truths about the world and January discovers a story increasingly entwined with her own.",
      "rating": 4.06,
      "ratings": 82217,
      "publicationYear": 2019
    },
    {
      "id": 57109937,
      "url": "https://www.goodreads.com/book/show/57109937-magical-midlife-meeting?from_choice=false&from_home_module=false",
      "title": "Magical Midlife Meeting (Leveling Up #5)",
      "author": "K.F. Breene",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1613591321l/57109937._SY475_.jpg",
      "description": "It's time for a magical battle Jessie isn't sure she's prepared for. nnElliot Graves has been a thorn in Jessie's side since before she agreed to take the house magic. He has constantly brought the fight to her doorstep.nnNot this time.nnWith the help of Austin's shifters, the Ivy house crew will meet Elliot Graves in one of the most dangerous places imaginable - his home turf.nnBut not before another creature joins the circle.",
      "rating": 4.64,
      "ratings": 6329,
      "publicationYear": 2021
    },
    {
      "id": 58642018,
      "url": "https://www.goodreads.com/book/show/58642018-suck-it?from_choice=false&from_home_module=false",
      "title": "Suck It (Shadow Guild: Vampire Bride #2)",
      "author": "Linsey Hall",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1627358794l/58642018._SY475_.jpg",
      "description": "All I want to do is tell the most powerful vampire in history to suck it.nnI thought I could trust my memories. I was wrong. A spell has made me forget who I am. But there are two things I do know: I'm the fated mate of the first and most powerful vampire, Drakon, and I'm the Daughter of the Arcane Order.nnI don't know what the Arcane Order is, but it's already led to one kidnapping attempt that I barely escaped. It’s also linked to a plot to kill hundreds of werewolves. It’s up to me to save them, but I can only do it with Drakon’s help.nnTo make things more complicated, Drakon has only a week before he's consumed by a curse meant to entrap his soul in granite. I’m not even sure I like him, but I do feel like our souls are pulled together. He’s enraging and sexy all at the same time, and I’m as desperate to save him as I am myself.nnSuck It is the second book in the Vampire Bride trilogy. If you like kickbutt heroines, powerful heroes, humor, and enemies-to-lovers, then this is the series for you.",
      "rating": 4.44,
      "ratings": 1478,
      "publicationYear": 2021
    },
    {
      "id": 54156078,
      "url": "https://www.goodreads.com/book/show/54156078-shadow-witch?from_choice=false&from_home_module=false",
      "title": "Shadow Witch (Witches of Hollow Cove, #1)",
      "author": "Kim Richardson",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1592498496l/54156078._SY475_.jpg",
      "description": "Are you ready for your next magical adventure?nnOkay, so I’m in trouble. Big trouble. I’m broke. Worse, my boyfriend of five years just dumped me.nnWhat do I do? I move in with my three eccentric aunts in their family home, Davenport House. Sounds exciting, only this massive farmhouse likes to eat men.nnIf I were a regular human, I would have run out screaming like a banshee. As a witch—I do absolutely nothing. Hey, maybe they deserved it?nnI’m back in Hollow Cove, the flamboyant paranormal community, where nymphs, werewolves, trolls, shifters, witches, and other paranormals live comfortable lives away from prying human eyes. As I settle into my new life, I decide to accept my aunts’ proposal and join the family business—the business of protecting our town and killing anything that would want to harm it.nnBut I’ve been away from the paranormal world for quite some time, and my magical abilities are a little bit rusty. Heck, they’re practically invisible.nnThings soon spiral down the crapper when people in our community start dropping like flies. And when demons start showing up in Hollow Cove, it’s up to me to take care of them. Permanently.nnThis is going to be awesome. I just know it.nnGet ready for this heart-pounding and laugh-out-loud magical adventure!nnIf you like fast-paced urban fantasy with a mix of witch cozy mystery, then you’ll love Shadow Witch.nnDon’t miss out on this fun witchy series. If you enjoy witch books with humor and kick-butt heroines, you won’t want to miss The Witches of Hollow Cove series.",
      "rating": 4.13,
      "ratings": 2094,
      "publicationYear": 2020
    },
    {
      "id": 53487148,
      "url": "https://www.goodreads.com/book/show/53487148-a-thousand-ships?from_choice=false&from_home_module=false",
      "title": "A Thousand Ships",
      "author": "Natalie Haynes",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1597694359l/53487148.jpg",
      "description": "From the Trojan women whose fates now lie in the hands of the Greeks, to the Amazon princess who fought Achilles on their behalf, to Penelope awaiting the return of Odysseus, to the three goddesses whose feud started it all, these are the stories of the women whose lives, loves, and rivalries were forever altered by this long and tragic war. nnA woman’s epic, powerfully imbued with new life, A Thousand Ships puts the women, girls and goddesses at the center of the Western world’s great tale ever told.",
      "rating": 4.12,
      "ratings": 24707,
      "publicationYear": 2019
    },
    {
      "id": 33375622,
      "url": "https://www.goodreads.com/book/show/33375622-her-body-and-other-parties?from_choice=false&from_home_module=false",
      "title": "Her Body and Other Parties",
      "author": "Carmen Maria Machado",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1485266434l/33375622.jpg",
      "description": "In Her Body and Other Parties, Carmen Maria Machado blithely demolishes the arbitrary borders between psychological realism and science fiction, comedy and horror, fantasy and fabulism. While her work has earned her comparisons to Karen Russell and Kelly Link, she has a voice that is all her own. In this electric and provocative debut, Machado bends genre to shape startling narratives that map the realities of women's lives and the violence visited upon their bodies.nnA wife refuses her husband's entreaties to remove the green ribbon from around her neck. A woman recounts her sexual encounters as a plague slowly consumes humanity. A salesclerk in a mall makes a horrifying discovery within the seams of the store's prom dresses. One woman's surgery-induced weight loss results in an unwanted houseguest. And in the bravura novella Especially Heinous, Machado reimagines every episode of Law & Order: Special Victims Unit, a show we naively assumed had shown it all, generating a phantasmagoric police procedural full of doppelgangers, ghosts, and girls with bells for eyes.nnEarthy and otherworldly, antic and sexy, queer and caustic, comic and deadly serious, Her Body and Other Parties swings from horrific violence to the most exquisite sentiment. In their explosive originality, these stories enlarge the possibilities of contemporary fiction.",
      "rating": 3.91,
      "ratings": 50284,
      "publicationYear": 2017
    },
    {
      "id": 59342854,
      "url": "https://www.goodreads.com/book/show/59342854-dungeon-walkers-2?from_choice=false&from_home_module=false",
      "title": "Dungeon Walkers 2",
      "author": "Daniel Schinhofen",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1634140384l/59342854._SY475_.jpg",
      "description": "Alistern “Stern” Masterson never expected to have the sort of life he found himself living. He was an irregular— a person who looked like the undead and had unusual perks— and his life hadn’t been very pleasant, so he’d written off the idea of ever finding anyone who understood him. Then, an old lady had asked for help, and he’d given it…nnStern was able to rescue Cyra Walot’s shards from the Bloodstone dungeon, after which he was brought before the city magistrate on false charges. Cyra helped him clear his name, and he was set free with the newly reborn Cyra beside him.nnAlthough the rabbit lykian had lived a rough life and died horribly inside the dungeon, she wasn’t about to let that stop her from following her own dream. Seeing her determination, Stern offered to help her. Together, they ran the starting dungeons so that Cyra could develop the skills she would need to survive as a Walker.nnStern and Cyra found a friend in Trish Moxy, an accomplished leatherworker. That friendship blossomed and grew, becoming something that none of them had expected.nnThe new triad relationship and fledgling crew trained together in Darkstone, preparing to take on the next set of dungeons. These would be much harder, but they felt like they had a chance if they worked together.nnAfter Darkstone, they set out for Waterrock. They were intent on finding people to fill out their crew, knowing they would need more allies for what the future held.nnn(This book contains non-standard relationships and touches upon adult situations.)",
      "rating": 4.65,
      "ratings": 460,
      "publicationYear": 2021
    },
    {
      "id": 58823779,
      "url": "https://www.goodreads.com/book/show/58823779-courting-darkness?from_choice=false&from_home_module=false",
      "title": "Courting Darkness (Fae Revealed, #1)",
      "author": "Katie May",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1632245917l/58823779._SY475_.jpg",
      "description": "My whole life has been characterized by fighting. nnFighting my family. nnAnd fighting for my life. nnTrust me—the first one is completely voluntary, and a lot of fun. The second? Not so much. nnTo say my family dynamic is weird is the understatement of the century. I held my first sword when I was only five years old, and I learned how to dispose of a body before I turned ten. nnI may have a penchant for pink and sparkles…but that doesn’t mean I don’t know how to kick major ass as well. nnAs if my life isn't complicated enough, my body is being ravaged by a chronic, mystery illness. nnSeizures? Check. Passing out? Check. Agonizing pain? Check. A host of other unexplainable ailments? Double check. nnAfter a change in my parents’ job takes us across the country, I find myself doing something I’ve never done before—attend an actual high school, despite my sickness. nnBut this school? Well…it’s a little weird...nnI'm always turned around, and there's something happening I just can't put my finger on. nnAnd don’t even get me started on my sexy as sin teacher and his equally as gorgeous twin brother. Or Tristan, who kind of reminds me of an energetic puppy. Or Kian, who has a harem of girls at his beck and call, despite seemingly unhappy with his entire life. Or Foster and Gage, who are revered and feared in equal measure. nnWith a serial killer stalking the streets of this odd, little town, my new friends and family are on high alert. nnOne thing becomes clear…nnHumans aren’t the only beings who walk this earth. nnAnd if I don’t uncover the secrets of my new school, I may be the killer’s next victim.nnnCourting Darkness is a reverse harem paranormal romance, meaning the main character will end up with more than one love interest by the end of the series. This is book ONE in the series. It will end with a cliffhanger.",
      "rating": 4.4,
      "ratings": 847,
      "publicationYear": 2021
    },
    {
      "id": 57711529,
      "url": "https://www.goodreads.com/book/show/57711529-other-people-s-things?from_choice=false&from_home_module=false",
      "title": "Other People's Things",
      "author": "Kerry Anne King",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1618204996l/57711529._SY475_.jpg",
      "description": "From the Amazon Charts bestselling author of Whisper Me This comes a witty, magical story about improbable connections, difficult gifts, and the unexpected events that heal us and bring us together.nnJailbird. Klepto. Spectacular failure to launch. Nicole Wood’s sticky fingers have earned her many names, but it’s not that she’s stealing—some objects just need to be moved elsewhere, and the universe has chosen her to do it. Still, being a relocator of objects isn’t easy. With her marriage on the rocks, no real-world skills, and the threat of prison hanging over her head, Nicole is determined to change her ways.nnThings seem to be looking up, thanks to a godsent job with her sister’s housecleaning business—until she encounters a seemingly harmless paperback that insists on moving from one client’s home to another’s. Nicole hopes no one will notice, but the action stirs up long-hidden secrets and triggers a series of fateful events that threatens to destroy the life she’s creating and hurt those closest to her. She’ll need to embrace her unwieldy gift and take a chance on love in order to unravel the mystery and fix what’s gone wrong.",
      "rating": 4.49,
      "ratings": 812,
      "publicationYear": 2021
    },
    {
      "id": 51941234,
      "url": "https://www.goodreads.com/book/show/51941234-ghost-mortem?from_choice=false&from_home_module=false",
      "title": "Ghost Mortem (Ghost Detective #1)",
      "author": "Jane Hinchey",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1583032620l/51941234._SY475_.jpg",
      "description": "Whoever said that ghosts exist must be out of their mind.nnOh, wait. That was me. I said that. If you’d told me yesterday that ghosts were real I would have smiled, nodded, and called a shrink to fix your deluded little mind. Now it’s my turn to question my sanity when the ghost of my best friend turns up in my apartment. Was it the tequila shots the night before causing this apparition? Or one too many bumps to the head — let’s face it, clumsy is my middle name, it really wouldn’t surprise me if I’d done some irreparable damage to my grey matter over the years.nnNow I have to accept that the paranormal does, in fact, exist. But sadly, my ghost friend is lacking something besides his body. His memory. He doesn’t know how he died but suspects foul play and he wants my help to find his killer. I can’t refuse, I’m a sucker for a good mystery and the chance to bring my friends killer to justice is too good to pass up.nnSurprises abound as I discover a secret talent for sleuthing, not to mention an unexpected inheritance of a talking cat among other things. But the biggest problem of all? Captain Cowboy Hot Pants, or as he likes to be called, Detective Kade Galloway of the Firefly Bay PD. He’s one smokin’ cop, but my distrust of the police runs deep and despite his assurances that he’s here to help can I really trust him, or is his offer of assistance designed to keep me from discovering the truth?nnI guess I’ll find out when death comes knocking on my door.nnJoin Audrey Fitzgerald in the Ghost Detective series, a paranormal cozy mystery featuring a cat, a ghost, and a murder to solve.",
      "rating": 4.51,
      "ratings": 1521,
      "publicationYear": 2020
    },
    {
      "id": 49869087,
      "url": "https://www.goodreads.com/book/show/49869087-the-mermaid-of-black-conch?from_choice=false&from_home_module=false",
      "title": "The Mermaid of Black Conch",
      "author": "Monique Roffey",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1625084134l/49869087._SY475_.jpg",
      "description": "Near the island of Black Conch, a fisherman sings to himself while waiting for a catch. But David attracts a sea-dweller that he never expected - Aycayia, an innocent young woman cursed by jealous wives to live as a mermaid.When American tourists capture Aycayia, David rescues her and vows to win her trust. Slowly, painfully, she transforms into a woman again. Yet as their love grows, they discover that the world around them is changing - and they cannot escape the curse for ever...",
      "rating": 4.05,
      "ratings": 6628,
      "publicationYear": 2020
    },
    {
      "id": 57484797,
      "url": "https://www.goodreads.com/book/show/57484797-fury?from_choice=false&from_home_module=false",
      "title": "Fury (Fuse #3)",
      "author": "E.L. Todd",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1616381083l/57484797._SY475_.jpg",
      "description": "From New York Times bestselling author E. L. Todd comes the final installment in the Fuse Trilogy.nnCora and her allies must defeat the most vile king in Anastille's history.nnWill they find victory?nnOr lose everything they have left?",
      "rating": 4.54,
      "ratings": 142,
      "publicationYear": 2022
    },
    {
      "id": 34995316,
      "url": "https://www.goodreads.com/book/show/34995316-a-rylee-adamson-omnibus-1-3?from_choice=false&from_home_module=false",
      "title": "A Rylee Adamson Omnibus, #1-3 (Rylee Adamson, #1-3)",
      "author": "Shannon Mayer",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1493254164l/34995316._SX318_.jpg",
      "description": "This omnibus edition contains the first three Rylee Adamson novels; Priceless, Immune and Raising Innocence.nnnn  PRICELESS (#1)nnn  “My name is Rylee and I am a Tracker.”nnWhen children go missing, and the Humans have no leads, I’m the one they call. I am their last hope in bringing home the lost ones. I salvage what they cannot.nnnI’m on the FBI’s wanted list.nnI have a werewolf for a pet, a Witch of a best friend, and have no need for anyone else in my life.nnBut when a salvage starts to spin out of control, help comes from a most unexpected direction. One that is dangerously dark, brooding, and doesn’t know a thing about the supernatural.nnOne whose kisses set me on fire.nnnn  IMMUNE (#2)n nn  “My name is Rylee, and I am a Tracker.”nnWhen children go missing, and the Humans have no leads, I’m the one they call. I am their last hope in bringing home the lost ones. I salvage what they cannot.nnnUnderestimating demons is a bad idea, and it’s a mistake that may cost me not only my own life, but the life of a missing child.nnIf I can swallow my pride, and allow Agent O’Shea to help me find a way to deal with the demon, we might be able to save the child.nnWith this salvage, it’s a race against time, a test of trust, and a temptation that I'm doing my damnedest to ignore.nnIf only swallowing my pride was that easy.nnnn  RAISING INNOCENCE (#3)nnn  My name is Rylee, and I am a Tracker.\"nnWhen children go missing, and the Humans have no leads, I’m the one they call. I am their last hope in bringing home the lost ones. I salvage what they cannot.nnnThe FBI wants me on their team. Bad enough that they are dangling bait they KNOW I can’t resist.nnThe catch? It’s on the other side of the ocean.nnAnd if I want what they’re offering, I have to help them with a salvage gone terribly, terribly wrong.nnBut this time, I have no back up. I have no Plan B.nnAnd I have no O’Shea.nnnnn“If you love the early Anita Blake novels by Laurel K. Hamilton, you will fall head over heels for The Rylee Adamson Series. Rylee is a complex character with a tough, kick-ass exterior, a sassy temperament and morals which she never deviates from. She’s the ultimate heroine. Mayer’s books rank right up there with Kim Harrison’s, Patricia Brigg’s, and Ilona Andrew’s. \" Just My Opinions Book Blog",
      "rating": 4.5,
      "ratings": 514,
      "publicationYear": 2016
    },
    {
      "id": 55138139,
      "url": "https://www.goodreads.com/book/show/55138139-kingdom-of-storms?from_choice=false&from_home_module=false",
      "title": "Kingdom of Storms (Desert Cursed, #8)",
      "author": "Shannon Mayer",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1598502174l/55138139._SY475_.jpg",
      "description": "Looking to rescue dragon hatchlings? Check. Piss off a demon in the process? Check. Have my mate stolen by a raging psycho who wants his babies? Damn . . . .nnI, Zamira “Reckless” Wilson, do solemnly swear I wanted a vacation from trouble. The problem is, trouble did not want a vacation from me or those that I love.nnWe managed to pass the first test set out for us by the desert goddess on our path to finding the dragon hatchlings. Of course, that means I really have the eye of Asag, the Beast from the East, on me now.nnMaks has been taken by a woman known as the Storm Queen. As her pet and possibly as her baby daddy. So instead of going after the second step that would take us closer to Asag and the dragons, I am racing south to the Sea of Storms to rescue Maks. Queen or no queen, I am not giving up on my mate.nnBut like all things in my life, nothing is going as planned. I’ve ended up with another Jinn to deal with, a five-year-old shifter who loves to call out my cursing, and a detour that takes me away from Maks.nnThe clock is ticking, and we are closing in on the players that would stop us from making things right . . .if only my black cat bad luck would ease off, we’d be good.",
      "rating": 4.69,
      "ratings": 872,
      "publicationYear": 2021
    },
    {
      "id": 52454426,
      "url": "https://www.goodreads.com/book/show/52454426-devolution?from_choice=false&from_home_module=false",
      "title": "Devolution: A Firsthand Account of the Rainier Sasquatch Massacre",
      "author": "Max Brooks",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1566875204l/52454426._SX318_SY475_.jpg",
      "description": "As the ash and chaos from Mount Rainier’s eruption swirled and finally settled, the story of the Greenloop massacre has passed unnoticed, unexamined . . . until now.nnBut the journals of resident Kate Holland, recovered from the town’s bloody wreckage, capture a tale too harrowing—and too earth-shattering in its implications—to be forgotten.n nIn these pages, Max Brooks brings Kate’s extraordinary account to light for the first time, faithfully reproducing her words alongside his own extensive investigations into the massacre and the legendary beasts behind it.n nKate’s is a tale of unexpected strength and resilience, of humanity’s defiance in the face of a terrible predator’s gaze, and inevitably, of savagery and death.n nYet it is also far more than that.n nBecause if what Kate Holland saw in those days is real, then we must accept the impossible. We must accept that the creature known as Bigfoot walks among us—and that it is a beast of terrible strength and ferocity.n nPart survival narrative, part bloody horror tale, part scientific journey into the boundaries between truth and fiction, this is a Bigfoot story as only Max Brooks could chronicle it—and like none you’ve ever read before.",
      "rating": 3.92,
      "ratings": 32261,
      "publicationYear": 2020
    },
    {
      "id": 41118857,
      "url": "https://www.goodreads.com/book/show/41118857-the-dragon-republic?from_choice=false&from_home_module=false",
      "title": "The Dragon Republic (The Poppy War, #2)",
      "author": "R.F. Kuang",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1539963703l/41118857._SY475_.jpg",
      "description": "The searing follow-up to 2018’s most celebrated fantasy debut – THE POPPY WAR.nnIn the aftermath of the Third Poppy War, shaman and warrior Rin is on the run: haunted by the atrocity she committed to end the war, addicted to opium, and hiding from the murderous commands of her vengeful god, the fiery Phoenix. Her only reason for living is to get revenge on the traitorous Empress who sold out Nikan to their enemies.nnWith no other options, Rin joins forces with the powerful Dragon Warlord, who has a plan to conquer Nikan, unseat the Empress, and create a new Republic. Rin throws herself into his war. After all, making war is all she knows how to do.nnBut the Empress is a more powerful foe than she appears, and the Dragon Warlord’s motivations are not as democratic as they seem. The more Rin learns, the more she fears her love for Nikan will drive her away from every ally and lead her to rely more and more on the Phoenix’s deadly power. Because there is nothing she won’t sacrifice for her country and her vengeance.nnThe sequel to R.F. Kuang’s acclaimed debut THE POPPY WAR, THE DRAGON REPUBLIC combines the history of 20th-century China with a gripping world of gods and monsters, to devastating effect.",
      "rating": 4.37,
      "ratings": 33469,
      "publicationYear": 2019
    },
    {
      "id": 56309169,
      "url": "https://www.goodreads.com/book/show/56309169-child-of-light?from_choice=false&from_home_module=false",
      "title": "Child of Light",
      "author": "Terry Brooks",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1616100241l/56309169.jpg",
      "description": "An all-new fantasy series about a human girl struggling to find her place in a magical world she’s never known.nnAt nineteen, Auris Afton Grieg has led an . . . unusual life. Since the age of fifteen, she has been trapped in a sinister prison. Why? She does not know. She has no memories of her past beyond the vaguest of impressions. All she knows is that she is about to age out of the children’s prison, and rumors say that the adult version is far, far worse. So she and some friends stage a desperate escape into the surrounding wastelands. And it is here that Auris’s journey of discovery begins, for she is rescued by a handsome yet alien stranger. Harrow claims to be Fae—a member of a magical race that Auris had thought to be no more than legend. Odder still, he seems to think that she is one as well, although the two look nothing alike. But strangest of all, when he brings her to his wondrous homeland, she begins to suspect that he is right. Yet how could a woman who looks entirely human be a magical being herself?nnTold with a fresh, energetic voice, this fantasy puzzle box is perfect for fans of Terry Brooks and new readers alike, as one young woman slowly unlocks truths about herself and her world—and, in doing so, begins to heal both.",
      "rating": 3.77,
      "ratings": 353,
      "publicationYear": 2021
    },
    {
      "id": 57624808,
      "url": "https://www.goodreads.com/book/show/57624808-vergissmeinnicht---was-man-bei-licht-nicht-sehen-kann?from_choice=false&from_home_module=false",
      "title": "Vergissmeinnicht - Was man bei Licht nicht sehen kann",
      "author": "Kerstin Gier",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1618499283l/57624808._SX318_.jpg",
      "description": "Quinn ist cool, smart und beliebt. Matilda entstammt der verhassten Nachbarsfamilie, hat eine Vorliebe für Fantasyromane und ist definitiv nicht sein Typ. Doch als Quinn eines Nachts von gruseligen Wesen verfolgt und schwer verletzt wird, sieht er Dinge, die nicht von dieser Welt sein können. Nur – wem kann man sich anvertrauen, wenn Statuen plötzlich in schlechten Reimen sprechen und Skelettschädel einem vertraulich zugrinsen? Am besten dem Mädchen von gegenüber, das einem total egal ist. Dass er und Matilda in ein magisches Abenteuer voller Gefahren katapultiert werden, war von Quinn so allerdings nicht geplant. Und noch viel weniger, sich unsterblich zu verlieben …",
      "rating": 4.39,
      "ratings": 1313,
      "publicationYear": 2021
    },
    {
      "id": 56755560,
      "url": "https://www.goodreads.com/book/show/56755560-the-cat-who-saved-books?from_choice=false&from_home_module=false",
      "title": "The Cat Who Saved Books",
      "author": "Sōsuke Natsukawa",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1620081395l/56755560.jpg",
      "description": "A celebration of books, cats, and the people who love them, infused with the heartwarming spirit of The Guest Cat and The Travelling Cat Chronicles.nnBookish high school student Rintaro Natsuki is about to close the secondhand bookstore he inherited from his beloved bookworm grandfather. Then, a talking cat named Tiger appears with an unusual request. The feline asks for—or rather, demands—the teenager’s help in saving books with him. The world is full of lonely books left unread and unloved, and Tiger and Rintaro must liberate them from their neglectful owners. nnTheir mission sends this odd couple on an amazing journey, where they enter different mazes to set books free. Through their travels, Tiger and Rintaro meet a man who leaves his books to perish on a bookshelf, an unwitting book torturer who cuts the pages of books into snippets to help people speed read, and a publishing drone who only wants to create bestsellers. Their adventures culminate in one final, unforgettable challenge—the last maze that awaits leads Rintaro down a realm only the bravest dare enter...",
      "rating": 3.61,
      "ratings": 2378,
      "publicationYear": 2017
    },
    {
      "id": 58566729,
      "url": "https://www.goodreads.com/book/show/58566729-bold-mercy?from_choice=false&from_home_module=false",
      "title": "Bold Mercy (Kait Silver, #3)",
      "author": "Laken Cane",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1626433977l/58566729._SY475_.jpg",
      "description": "It's hard to concentrate on work when you've just moon-shifted with your alpha...nnBut the council that recruited me doesn't waste any time handing me my first assignment--and it just happens to be personal to me.nnI have to slay the warped evil that is Avis Vine--a human servant so twisted and changed by her former master's bad blood magic that she's no longer really human. She's a powerful, raging creature bent on revenge and filled with darkness and bloodlust.nnAnd making me suffer is her only goal.nnBut my wolf and I, we know about goals. We have goals. And we're just a little twisted ourselves.nnWe aren't about to wait for Avis to find us. We're going to hunt her down, and we're going to end her miserable life before she can achieve her only purpose in life--killing the people I love, the same way I killed her master.nnFrederick Axton was her only reason for living, and I took him away from her.nnYou can see how that might piss a girl off.nnAnd the longer I battle Avis Vine, the more I realize she's not going to be easy to end. As she blows through my city like a violent, destructive cyclone, I have to wonder...nnCan I stop her before she shatters me and destroys my entire world?",
      "rating": 4.3,
      "ratings": 548,
      "publicationYear": 2021
    },
    {
      "id": 57233925,
      "url": "https://www.goodreads.com/book/show/57233925-witchy-reservations?from_choice=false&from_home_module=false",
      "title": "Witchy Reservations",
      "author": "Stephanie Damore",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1614526413l/57233925._SY475_.jpg",
      "description": "There's nothing practical about magic—which is why I ditched my wand years ago.nnSeven years, to be exact.nnThe day I left Silverlake.nnExcept now, a family emergency has called me back home, and quite frankly, I'd rather be anywhere but here.nnBut when my aunt raises her wand to cure a friend and he ends up dead, it becomes abundantly clear I'm not leaving anytime soon.nnWelcome to Silverlake, a place where nothing is EVER as it seems... and where a witch can find, and lose, a lot more than herself.",
      "rating": 4.18,
      "ratings": 1138,
      "publicationYear": 2020
    },
    {
      "id": 55449673,
      "url": "https://www.goodreads.com/book/show/55449673-the-one-and-only-crystal-druid?from_choice=false&from_home_module=false",
      "title": "The One and Only Crystal Druid (The Guild Codex: Unveiled #1)",
      "author": "Annette Marie",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1601055665l/55449673.jpg",
      "description": "I'm not your average girl.nnMy best friend is my switchblade. My favorite hobby is using it on the cruel, the abusive, and anyone who gets on my bad side. I'm a convicted murderer with a chip on my shoulder and a dangerous lack of restraint.nnAnd then there's Zak.nnHis rap sheet makes mine look tame. The bounty on his head is worth more money than I'll ever make, and the deadly fae that shadow his every step wield more power than I'll ever know.nnHe's the Crystal Druid, and his first mistake was setting foot on my turf.nnHis second was saving my life.nnAnd his final mistake will be failing to realize that however dark, however ruthless, however broken he is…nnI'm worse.nn--nFrom the author of the best-selling Guild Codex books comes a new series that delves into the dark, dangerous world of druids and fae alongside two ravaged souls who may be exactly what the other needs…if they don't destroy each other first.nnUnveiled can be read as a standalone series or in conjunction with other Guild Codex series. For the full reading order, visit Annette Marie's website.nn--nMore series in the Guild Codex world:nThe Guild Codex: SpellboundnThe Guild Codex: DemonizednThe Guild Codex: Warped",
      "rating": 4.55,
      "ratings": 1636,
      "publicationYear": 2021
    },
    {
      "id": 32903085,
      "url": "https://www.goodreads.com/book/show/32903085-la-temp-te-des-chos?from_choice=false&from_home_module=false",
      "title": "La Tempête des échos (La Passe-Miroir, #4)",
      "author": "Christelle Dabos",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1569515113l/32903085._SX318_.jpg",
      "description": "Le monde est sens dessus dessous. L’effondrement des arches a bel et bien commencé. Une seule solution pour l’enrayer : trouver le responsable. Trouver l’Autre. Mais comment faire sans seulement savoir à quoi il ressemble ? Ophélie et Thorn se lancent ensemble sur la piste des échos, ces étranges phénomènes qui semblent la clef de toutes les énigmes. Ils devront explorer plus en profondeur les coulisses de Babel ainsi que leur propre mémoire. Et pendant ce temps, sur Arc-en-Terre, Dieu pourrait bien obtenir le pouvoir qu’il convoite tant. De lui ou de l’Autre, qui représente la plus grande menace ?",
      "rating": 3.76,
      "ratings": 14063,
      "publicationYear": 2019
    },
    {
      "id": 57106715,
      "url": "https://www.goodreads.com/book/show/57106715-the-wicche-glass-tavern?from_choice=false&from_home_module=false",
      "title": "The Wicche Glass Tavern (Sam Quinn #3)",
      "author": "Seana Kelly",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1621584587l/57106715._SY475_.jpg",
      "description": "I’m Sam Quinn, the werewolf book nerd owner of the Slaughtered Lamb Bookstore and Bar. Clive, my vampire gentleman caller, has asked me to marry him. His nocturne is less than celebratory. Unfortunately, for them and the sexy vamp doing her best to seduce him, his cold, dead heart beats only for me.nnAs much as my love life feels like a minefield, it has to take a backseat to a far more pressing problem. The time has come. I need to deal with my aunt, the woman who’s been trying to kill me for as long as I can remember. She’s learned a new trick. She’s figured out how to weaponize my friends against me. To have any hope of surviving, I have to learn to use my necromantic gifts. I need a teacher. We find one hiding among the fae, which is a completely different problem. I need to determine what I’m capable of in a hurry because my aunt doesn’t care how many are hurt or killed as long as she gets what she wants. Sadly for me, what she wants is my name on a headstone.nnI’m gathering my friends—werewolves, vampires, wicches, gorgons, a Fury, a half-demon, an elf, and a couple of dragon-shifters—into a kind of Fellowship of the Sam. It’s going to be one hell of a battle. Hopefully, San Francisco will still be standing when the dust clears.",
      "rating": 4.52,
      "ratings": 661,
      "publicationYear": 2021
    },
    {
      "id": 56528296,
      "url": "https://www.goodreads.com/book/show/56528296-a-twist-of-fate?from_choice=false&from_home_module=false",
      "title": "A Twist of Fate (A Stitch in Time #2)",
      "author": "Kelley Armstrong",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1616862242l/56528296.jpg",
      "description": "Four years ago, Rosalind Courtenay stumbled from the nineteenth century to the twenty-first, where she has been trapped ever since, leaving her husband and infant son behind. Now she’s found her way back.nnThe problem, of course, is how to explain her absence to her husband. Does he think she abandoned him? Has he remarried? Is he happy in a new life? Rosalind decides to don a disguise in hopes of answering her questions before showing up on his doorstep. Instead, a twist of fate has her mistaken for her young son’s new governess.nnRosalind has every intention of revealing herself as soon as August returns home from business. Until then, she’ll get to know her son, a quiet child who has inexplicably been abandoned by an endless stream of governesses. That’s when the hauntings begin. Rosalind has finally come home and something—or someone—doesn’t just want her gone. They want her dead.",
      "rating": 4.11,
      "ratings": 731,
      "publicationYear": 2021
    },
    {
      "id": 55782435,
      "url": "https://www.goodreads.com/book/show/55782435-the-book-of-accidents?from_choice=false&from_home_module=false",
      "title": "The Book of Accidents",
      "author": "Chuck Wendig",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1606934104l/55782435.jpg",
      "description": "A family returns to their hometown—and to the dark past that haunts them still—in this masterpiece of literary horror by the New York Times bestselling author of WanderersnnLong ago, Nathan lived in a house in the country with his abusive father—and has never told his family what happened there.nnLong ago, Maddie was a little girl making dolls in her bedroom when she saw something she shouldn’t have—and is trying to remember that lost trauma by making haunting sculptures.nnLong ago, something sinister, something hungry, walked in the tunnels and the mountains and the coal mines of their hometown in rural Pennsylvania.nnNow, Nate and Maddie Graves are married, and they have moved back to their hometown with their son, Oliver.n nAnd now what happened long ago is happening again . . . and it is happening to Oliver. He meets a strange boy who becomes his best friend, a boy with secrets of his own and a taste for dark magic.nnThis dark magic puts them at the heart of a battle of good versus evil and a fight for the soul of the family—and perhaps for all of the world. But the Graves family has a secret weapon in this battle: their love for one another.",
      "rating": 3.91,
      "ratings": 5832,
      "publicationYear": 2021
    },
    {
      "id": 28110852,
      "url": "https://www.goodreads.com/book/show/28110852-the-girl-who-drank-the-moon?from_choice=false&from_home_module=false",
      "title": "The Girl Who Drank the Moon",
      "author": "Kelly Barnhill",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1485376116l/28110852._SY475_.jpg",
      "description": "Every year, the people of the Protectorate leave a baby as an offering to the witch who lives in the forest. They hope this sacrifice will keep her from terrorizing their town. But the witch in the forest, Xan, is kind and gentle. She shares her home with a wise Swamp Monster named Glerk and a Perfectly Tiny Dragon, Fyrian. Xan rescues the abandoned children and deliver them to welcoming families on the other side of the forest, nourishing the babies with starlight on the journey.  One year, Xan accidentally feeds a baby moonlight instead of starlight, filling the ordinary child with extraordinary magic. Xan decides she must raise this enmagicked girl, whom she calls Luna, as her own. To keep young Luna safe from her own unwieldy power, Xan locks her magic deep inside her. When Luna approaches her thirteenth birthday, her magic begins to emerge on schedule--but Xan is far away. Meanwhile, a young man from the Protectorate is determined to free his people by killing the witch. Soon, it is up to Luna to protect those who have protected her--even if it means the end of the loving, safe world she’s always known.",
      "rating": 4.1,
      "ratings": 70778,
      "publicationYear": 2016
    },
    {
      "id": 57865473,
      "url": "https://www.goodreads.com/book/show/57865473-mated-girl?from_choice=false&from_home_module=false",
      "title": "Mated Girl (Wolf Girl, #4)",
      "author": "Leia Stone",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1619478418l/57865473._SY475_.jpg",
      "description": "I finally made it out of the Dark Woods only to learn that Sawyer is in prison, our people are still at war, and the wolves are hiding underground. It will take every ounce of strength I have in order to save our people, get my man back, and bring down the queen.nnI can't do this alone, and calling on an old friend proves to be the best decision I could ever make. Nothing will keep me from my mate, not even the magical world's most high security prison.nnYou will love the twists and turns in this epic conclusion to the bestselling Wolf Girl series!",
      "rating": 4.42,
      "ratings": 3062,
      "publicationYear": 2021
    },
    {
      "id": 57456018,
      "url": "https://www.goodreads.com/book/show/57456018-he-who-fights-with-monsters-2?from_choice=false&from_home_module=false",
      "title": "He Who Fights with Monsters 2 (He Who Fights with Monsters, #2)",
      "author": "Shirtaloon",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1616122903l/57456018._SX318_.jpg",
      "description": "The path from retail middle management to interdimensional wizard adventurer wasn’t easy, but Jason Asano is settling into his new life.nnNow, a contest draws young elites to the city of Greenstone, competing for a grand prize. Jason must gather a band of companions if he is to stand a chance against the best the world has to offer.nnWhile the young adventurers are caught up in competition, the city leaders deal with revelations of betrayal as a vast and terrible enemy is revealed. Although Jason seems uninvolved, he has unknowingly crossed the enemy’s path before. Friends and foes made along the way will lead him to cross it again as inevitable conflict looms.",
      "rating": 4.62,
      "ratings": 4029,
      "publicationYear": 2021
    },
    {
      "id": 55440232,
      "url": "https://www.goodreads.com/book/show/55440232-the-women-of-troy?from_choice=false&from_home_module=false",
      "title": "The Women of Troy (Women of Troy, #2)",
      "author": "Pat Barker",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1603739353l/55440232.jpg",
      "description": "Troy has fallen. The Greeks have won their bitter war. They can return home as victors - all they need is a good wind to lift their sails. But the wind has vanished, the seas becalmed by vengeful gods, and so the warriors remain in limbo - camped in the shadow of the city they destroyed, kept company by the women they stole from it.The women of Troy.Helen - poor Helen. All that beauty, all that grace - and she was just a mouldy old bone for feral dogs to fight over.Cassandra, who has learned not to be too attached to her own prophecies. They have only ever been believed when she can get a man to deliver them.Stubborn Amina, with her gaze still fixed on the ruined towers of Troy, determined to avenge the slaughter of her king.Hecuba, howling and clawing her cheeks on the silent shore, as if she could make her cries heard in the gloomy halls of Hades. As if she could wake the dead.And Briseis, carrying her future in her womb: the unborn child of the dead hero Achilles. Once again caught up in the disputes of violent men. Once again faced with the chance to shape history.Masterful and enduringly resonant, ambitious and intimate, The Women of Troy continues Pat Barker's extraordinary retelling of one of our greatest classical myths, following on from the critically acclaimed The Silence of the Girls.",
      "rating": 3.94,
      "ratings": 2462,
      "publicationYear": 2021
    },
    {
      "id": 55886594,
      "url": "https://www.goodreads.com/book/show/55886594-the-witching-flour?from_choice=false&from_home_module=false",
      "title": "The Witching Flour (Spellford Cove Mystery #1)",
      "author": "Samantha Silver",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1605284665l/55886594._SY475_.jpg",
      "description": "Welcome to Spellford Cove, where the baking is sweet and the witches are wild.nnRobin Carter's life is less than stellar. All she has going for her are a minimum-wage job she hates, an uncanny ability to attract the biggest losers on her dating app, and a raccoon sitting in her kitchen sink eating her chips. So, when she finds out she's inherited a bakery in a small Washington town, Robin thinks this might just be the fresh start she desperately needs. Upon her arrival, however, Robin finds out she's inherited more than just a small business: she's also got her mother's magical powers.nnHowever, things start going south for Robin when a man dies at the local diner just after her arrival in town and she's fingered as the prime suspect. With half the town thinking she's a killer, Robin decides to take matters into her own hands. But between a ghost who desperately needs therapy, a snarky familiar who loves to quote literature, and a grandmother who walks to the beat of her own drum, Robin really has her hands full.nnWill she be able to navigate this new reality and find the killer, or will she crumble like an overcooked brownie?nnThis is the first book in the Spellford Cove paranormal cozy mystery series.",
      "rating": 4.32,
      "ratings": 961,
      "publicationYear": 2021
    },
    {
      "id": 34886295,
      "url": "https://www.goodreads.com/book/show/34886295-fury-of-a-phoenix?from_choice=false&from_home_module=false",
      "title": "Fury of a Phoenix (Nix, #1)",
      "author": "Shannon Mayer",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1494861478l/34886295._SY475_.jpg",
      "description": "n  I knew the sins of my past would call to collect what was left of my soul. If I'd known the price I'd pay, I would've sacrificed more to stay hidden from the magic.n n nIn the middle of Wyoming--away from the abnormals of the world--I thought I was free and clear. I started a new life. Found a love I'd never known in a husband, and a son who was my everything. n nAnd in a blinding instant, that life was stolen from me. n nThe rage of a grieving mother is an ugly beast. More so when she has the skills and killer instinct to back up the wrath and the knowledge that an accident was anything but. n nOnce more, I will pick up my guns. This time to hunt those who took my husband's and son's lives.n nLet them see the assassin, trained to kill abnormals, stalk the shadows again. n nLet them see the Phoenix rise from the fragments of a broken life as she burns with a fury that cannot be contained.n nLet the killing games begin.",
      "rating": 4.25,
      "ratings": 5280,
      "publicationYear": 2017
    },
    {
      "id": 59062606,
      "url": "https://www.goodreads.com/book/show/59062606-glimmer-of-death?from_choice=false&from_home_module=false",
      "title": "Glimmer of Death (The Other Realm #3)",
      "author": "Heather G. Harris",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1632424182l/59062606._SY475_.jpg",
      "description": "I’m Jinx, a private investigator, a truth seeker and an empath. Even with all that magic at my fingertips, I don’t know if I can save my best friend.nnAnd she’s not the only ill one. The magical creatures of the Other Realm are falling sick – even the supposedly immortal ones. The illness is striking two by two like a plague filled Noah’s Ark. The mermen asked for help first, but it turns out they’re just the tip of the iceberg.nnGato and I need to find the source of the sickness, to stop it spreading and to find the antidote. Emory’s adoptive parents are two of the ones that have fallen sick and I can’t watch him lose his pseudo parents when I’ve already lost mine. I’ll do anything to save the stricken victims - even if it means working with my parents’ own killer…nnI know this much, the illness isn’t natural, and whoever is behind this has nothing but sinister intentions.nnI need to find the perpetrator.nnI need to find the cure.nnAnd I need to work out how I feel about Emory. I don’t know which task will be harder…",
      "rating": 4.74,
      "ratings": 82,
      "publicationYear": 2021
    },
    {
      "id": 34341759,
      "url": "https://www.goodreads.com/book/show/34341759-born-in-fire-fire-and-ice-trilogy-1?from_choice=false&from_home_module=false",
      "title": "Born in Fire (Fire and Ice Trilogy, #1) (Demon Days, Vampire Nights, #1)",
      "author": "K.F. Breene",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1487545450l/34341759._SY475_.jpg",
      "description": "Alternate cover edition of ASIN B06VXR25KZ.nnnHeart pounding and laugh out loud funny, USA Today Bestselling author K.F. Breene will take you on a magical joy ride you won't soon forget. Supernatural Bounty Hunter isn't the sort of thing you see on LinkedIn. But with a rare type of magic like mine, I don't have many options.So dangerous or not, the job is mine. And it was going fine, until an old as sin vampire stole my mark, and with it, my pay day.Knowing I'm poor and desperate, he has offered me a job. I'll have to work by his side to help solve a top secret case.Everyone knows not to trust vampires. Especially a hot elder vampire. But without any other jobs coming up, I'm stuck. As I uncover a web of lies and treachery, revealing an enemy I didn't know existed, the truth of my identity is threatened. I might make it out alive, only to end up in a gilded cage.",
      "rating": 4.16,
      "ratings": 25553,
      "publicationYear": 2017
    },
    {
      "id": 57838848,
      "url": "https://www.goodreads.com/book/show/57838848-playboy-king?from_choice=false&from_home_module=false",
      "title": "Playboy King (Underworld Bride Trials, #1)",
      "author": "Meg Xuemei X.",
      "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1619292643l/57838848._SY475_.jpg",
      "description": "She walks in on me banging another woman.nOne sniff in her direction, and I know she's mine.nScenting its fated mate, my wolf awakens and roars with lust.nBut Tessa Morrigan can't be my queen.nShe came too late.nI've started the Underworld Bride Trials. All the women must fight to the death until the last one stands by my side.",
      "rating": 4.15,
      "ratings": 1413,
      "publicationYear": 2021
    }
  ]
}